[
  {
    "address": "0xc1b8662A68F3eb66bC5e5C4DE7C1EF04Dc344d53",
    "bio": "I've been a DCL SDK developer for over a year and am an active member on discord. I attend every Townhall meeting and act as a mentor in the #sdk channel regularly. I host a weekly SDK meetup group every Wednesday where I teach people how to build in decentraland. I build every day, even weekends.",
    "links": [
      "https://www.youtube.com/channel/UCeV8zMwwclJX7Bf-JdxdJxw",
      "https://www.npmjs.com/package/dclconnect",
      "https://www.meetup.com/ethbuilders/events/mfcsrsydcdbfb/"
    ],
    "relevant_skills": [
      "Fullstack web developer (API/UI/Devop)",
      "Graphic designer",
      "3d modeler",
      "SDK mentor",
      "Grant Beneficiary"
    ],
    "involvement": "I work in decentraland all day to some degree. I'm either working on blockchain projects or building utilities/tools or training people in building. I consult with many metaverse companies and champion dcl to people who are skeptical.\n\n(How long have you been involved? How did you contribute?)\nOver a year or so. I'm very active in the community. Message me on discord!",
    "motivation": "I have an intimate understanding of building in dcl and have a great understanding of what effort is needed to achieve certain proposals. I'm also a dcl player, so I know what things have been attempted in the past and I pay attention to upcoming technologies that may be interesting/useful to implement into decentraland.\n\n(What kind of changes do you want to promote in the DAO? What's important to you?)\nFairness and freedom are critical. A healthy community that can build together. I enjoy networking people so they can collaborate instead of compete. I think these principals are important to the long term success of dcl.",
    "vision": "I'd like to see DCL become a place where users explore and create content in a censorship free and constantly improving/evolving ecosystem. Adopting new technologies in meaningful ways so that it's always competing for the top spot as a metaverse destination.\n\n(What do you want to see? What is the role of the DAO in it?)\nThe DAO is great for issuing grants that can have a meaningful impact on the community as a whole, and the polls are important to gauge community interest as well as help steer the development roadmap in a more accessible/future-proofed direction for everyone.",
    "most_important_issue": "Creating content is challenging. It should be much simpler and more fun to do. With more content there will be more users. Content in any form, 3d models, games, video streams, ect. 'If you build it, they will come.'\n\n(What challenges will we face in the next 12 to 24 months?)\nOther metaverses will slowly gain attraction due to having better graphics capabilities or easier content creation processes. At least temporarily. It will be important for dcl to leverage as many cool and interesting (open sourced) technologies as possible to keep pace with them. Although in the end, I believe dcl will win out as it's the linux of metaverses."
  },
  {
    "address": "0x3fB38CEe8d0BA7Dcf59403a8C397626dC9c7A13B",
    "bio": "Hi! My name is Avi but most people around here call me Morris. Came to Decentraland having been in the crypto space since 2016. Im a big fan of buffalo chicken wraps and I like to program stuff.",
    "links": [],
    "relevant_skills": [
      "Web3/solidity developer",
      "web2 full stack developer",
      "DCL sdk developer",
      "data hoarder",
      "grant beneficiary"
    ],
    "involvement": "Joined the Decentraland community at the beginning of January 2021. The open source nature of the project allowed me to jump in and start participating in my own way, no permission needed. Set out to become a data provider in the Metaverse, making use of the data streams from Decentraland to produce meaning analytics for different organizations in the community.\n\nWhen the new snapshot voting space for the DAO was established, I realized there were ways beyond programming that I could contribute to Decentraland. I am an active participant in the DAO discussions in discord and on the forum.\n\nI am developer with Atlas Corporation, a web3 development group started within Decentraland. Our team works closely with many different groups around Decentraland to provide infrastructure, smart contract development, and analytics.",
    "motivation": "I am a big believer in voter power delegation and the idea of liquid democracy. This drove me to submit the original proposal to bring delegation to the Decentraland DAO. Immediately following its implementation, I posted about being a candidate for delegation and was asked this same question. I had trouble answering this question at the time, because I still didn't understand what the DAO really was, what it could do, or how power it can be. I just knew that I was willing to put in the time, and make DAO participation part of my normal routine.\n\nOver the last 8 months, my reasons for wanting to be a delegate have become clearer to me. First and foremost, I live and breathe Decentralization above all else. This acts as a guiding light in my decision making. Delegation, by its very nature, while seemingly an act of centralization, allows for the decentralized pooling of voting power based on trust, and provides a force to equate the masses voting power with that of the powerful few who possess consolidated voting power.\n\nAnother foundational value that guides my decision making is the protection of the assets of Decentraland, across the whole stack. This means maintaining the integrity of the smart contracts that govern land and estates, names, wearables, and how they trade within the platform. Making sure Decentraland remains true to its open source nature is of vital importance to me.\n\nRegardless of your delegate selection, I encourage you to participate in the delegation process if you are not an active participant in the DAO. Unlock the VP and allow for more meaningful outcomes for the Decentraland community.",
    "vision": "Its hard to imagine where we will be in 5 years as that seems to be an eternity in this space. I'd like to see many independent development teams form and start working on DAO funded projects, further moving Decentraland towards decentralized development. With that, I would love to see the DAO have a functional delegation program, and possibly introduce categorical delegation to elevate experts in their respective fields.\n\nI predict we will see multiple clients introduced, free and paid, 2d and VR. Having multiple clients connect to the same content servers will begin to highlight the protocol nature of Decentraland rather than looking at it like a centralized game controlled by one group. Options are good and healthy, and ideally drive forward innovation.\n\nDecentraland will stand alone in the next 5 years as 100s of centralized 'Metaverses' are realized. Slow and steady wins the race.",
    "most_important_issue": "Over the next 24 months, I expect to see a few issues come to light, specifically mana tokenomics, land contract integrity, copyright infringements, adult content, and gambling. The Mana tokenomics, a deflationary currency, is at odds with the use case. Its predictable that with mana/USD movements, DCL citizens immediately call for the repricing of goods and services. As we travel further down this path, we need to add stability to our ecosystem. Something will need to be done to address this issue so that we don't get bogged down in repricing at every corner. We should be building, not retracing our steps constantly. I have some suggestions here but don't want to drift to far down that path in this forum.\n\nThe second issue we will face repeatedly over the next 24 months is changing the land contract, either for lost land or to expand the map. With a fixed number of parcels and rising market, there will be calls from current or newer DCL citizens who did not purchase land early to add parcels in the name of fairness and equality. We will also be faced with the lost land discussion a few times. We need to hold strong. Social pressure to change can be overwhelming but we are here because we believe in blockchain and immutability. We cannot sacrifice all we have worked towards.\n\nThird issue we will bump into is how decentralization is at odds with copyright infringements. Any scene owner can import any content, regardless of who owns it. Traditional brands typically have the legal rails to deal with this issue. Decentralizing the servers makes the process of a DMCA takedown extremely complicated if not impossible. While I am in favor of decentralization and all the disruption it brings, such systems will be in the spotlight over the next 24 months as traditional brands begin entering the space.\n\nNot much adult content on the platform currently and you have to know where to look to find it. As more people join Decentraland, that niche will grow larger. Decentraland does not have any real way, nor should it, to verify age. Coupled with the decentralization of the servers, adult content on the Decentraland platform could pose a problem in meeting the laws of all the countries in which these servers are accessible. Regardless of Terms of Service on the use of the client and or the servers, this will still be an issue that needs to be confronted.\n\nThe last issue for Decentraland will be gambling and how it meets global regulation. With my experience over the past year, I can assure you that more gaming is coming to the Metaverse. Reegulators haven't done much on this front and the organization's in Decentraland are adapting ahead of any issues, but I could see this entering the news cycle, with the citizens of DCL having to defend that Decentraland does not exist solely for gambling."
  },
  {
    "address": "0x76fb13f00CdbdD5eAC8E2664CF14be791aF87cb0",
    "bio": "Currently serve as the DCL DAO Facilitator, and in the process of launching Sanctuary DAO, a Conscious DAO-Building DAO for Stewardship of Organizations that are committed to and will build more preferable futures. Recently co-designed Big Green DAO and am operationalizing Big Green DAO a first of its kinda giving DAO that aims to democratize and decentralize philantropy. Currently a Future Studies PhD Candidate, researching Democratic and Decentralized Futures.",
    "links": ["https://dao.biggreen.org/", "https://twitter.com/MetaMatimio"],
    "relevant_skills": [
      "Anticipatory Governance Design",
      "DAO Design",
      "Governance Facilitation",
      "Monitoring and Evaluation",
      "OSINT"
    ],
    "involvement": "Currently DAO Facilitator & Member of Last Slice Collective\n\n(How long have you been involved? How did you contribute?)\n1 year. Do my best to facilitate governance and help community members express their interests as policy, and the DAO committee respond to and implement this policy to the best of our abilities.",
    "motivation": "Increase voter participation in the DAO, increase my ability to bring voting power to important community interests to make sure our voice is heard to the fullest extent possible. We are the future of the DAO and our DAO will only be successful to the extent that we participate in it, and take a stewardship role over its continued growth. I am committed to the success of our social experiment and foresee myself being an very longstanding member of the DCL DAO and broader DCL Community.\n\n(What kind of changes do you want to promote in the DAO? What's important to you?)\nMake our governance structures as robust, representative and sustainable over the long term as possible. There is no one specific policy I want to see changed, rather I am committed to our policies as a whole circulate and regulate power in a way that prevents over centralization to the extent that our mission is diluted and hyper-decentralization to the extent that we are not able to get anything done.",
    "vision": "Active and engaged DAO community, with functional and battled tested governance structures capable of responding to changing circumstances and dynamics in the Metaverse and IRL as the web3, NFT and metaverse spheres expand and increasingly take on mainstream adoption.\n\n(What do you want to see? What is the role of the DAO in it?)\nIt is front and center in this vision =).",
    "most_important_issue": "Governance =).\n\n(What challenges will we face in the next 12 to 24 months?)\nGrowth. Competition. Competing interests and the need to develop structures that are both flexible and agile, yet secure and able to provide a foundation for stable governance of our metaverse world."
  },
  {
    "address": "0x9A739c2e212754c3d8432CB717dC9437e5b3Dfae",
    "bio": "My name is Sean Ong and I am based in Seattle, USA. I am an avid VR/AR developer and entrepreneur that has founded several metaverse companies. A long-time investor in $MANA and huge proponent of Decentraland, I have recently been deeply involved with Decentraland development, bringing VR support and immersive building support to the DCL platform.",
    "links": [
      "https://github.com/mr0ng",
      "https://www.linkedin.com/in/seanong/",
      "https://www.xrdevstudio.com/",
      "https://www.youtube.com/c/seanong"
    ],
    "relevant_skills": ["AR and VR Dev", "Unity", "Management", "Finance", "Economics", "Business"],
    "involvement": "Decentraland DAO Grant Recipient\n\nCurrently leading team to develop VR play+building support for Decentraland\n\nEngaged with Decentraland community on Discord and Reddit",
    "motivation": "As a proponent of Decentraland and also someone who is invested in Decentraland, I would like to represent those who are also invested in Decentraland. I would like to vote on proposals that would enhance and grow Decentraland, thereby generating value for all VP stakeholders. Similarly, I would like to vote against proposals that would harm Decentraland or that would have negative impacts to the future growth of Decentraland.",
    "vision": "I see Decentraland being the top Metaverse platform for the foreseeable future. I do consider it to be the top metaverse today. As spatial computing and XR devices become more ubiquitous over the next 5 years, I see the metaverse becoming increasingly important in our daily lives and for our livelihood. My vision is that within 5 years, Decentraland will be a primary income source and economic powerhouse for millions of people around the world, and will be a forerunner in the decentralized global economy.",
    "most_important_issue": "I think the most important issue is that we avoid Decentraland becoming trapped in age-old issues that has plagued governance throughout human history. Corruption, politics, unfairness, injustice, censorship, excess regulation, and other topics will be easy for Decentraland to fall into. Instead, we need to learn from history to guide Decentraland and not let Decentraland 'run its course.' It's not an easy problem to solve, but I believe it's the most important for a healthy economy and will require all of us working together to build a better system that provides opportunities for all people, both rich and poor."
  },
  {
    "address": "0xCF10CD8B5Dc2323B1eb6de6164647756BAd4dE4d",
    "bio": "I am an interactive media creator building Golfcraft in Decentraland, and exploring Artificial Intelligence applied to virtual beings.",
    "links": ["https://twitter.com/EibrielBot"],
    "relevant_skills": ["web3", "programming", "community moderation"],
    "involvement": "I've been involved since 2020, a couple of months after public launch. Since then I've been developing games and experiences. I'm currently one of the Developers of the game Golfcraft, and the virtual pet Compicactus.\n\nGolfcraft is currently being funded by grants from the DAO.",
    "motivation": "I'm looking to help fund amazing creators. We need more content to attract and retain users. And more tools to help build.",
    "vision": "In 5 years Decentraland should be a place to make friends, make business and share ideas. It should be a complete social network, with interconnected experiences (some of them sponsored by big brands), and multiple clients (browser, desktop, mobile, VR).\n\nThe role of the DAO will be to steer the development, allowing Decentraland to accommodate to the changes in technology and user preferences.",
    "most_important_issue": "External challenges:\n\nFUD: Decentraland needs a strong communication strategy to share its vision\nTechnology limitations to be decentralized and remain competitive.\nInternal challenges:\n\nDifficulty to communicate its vision in a consistent and frequently: needs some extra PR work\nCurrent social tools are limited (chat, moderation)\nAlthough much improved, user self expression is still restrained: DCL needs more ways to allow users to make the world their own."
  },
  {
    "address": "0xB2223F4038DEf8A62a86E3c4b108CDfE00a74C4f",
    "bio": "It's butter! That guy that actively lurks in the discord/telegram' Mainly #SDK, #DAO, #LAND and #GENERAL. I've built a few events for different projects through the SDK. With favorites such as Keep network, realfake, astar and unbanked.",
    "links": ["https://github.com/ERC20s"],
    "relevant_skills": ["Web3", "solidity", "js", "ts", "wss", "sdk", "blender"],
    "involvement": "I've been around since Nov 2019. Hosted my first event for keep network around june 2020. RealFakeBrand was around March 2021' Astar plot was deployed in december 2021' Now Unbanked is live at the moment and will probably stay live for a while here: https://play.decentraland.org/?island=I1dkmo&position=-137,-24&realm=loki",
    "motivation": "I generally give my votes for teams that I feel will benefit the game. And I don't support projects that just benefit the grantee. I'm also declaring myself a full-time metaverse guy now so it would be good to have some extra VP'",
    "vision": "I really want to see more top brands coming in and bringing more active users. I'm going to be working full-time with unbanked and astar to bring more products, events and games'",
    "most_important_issue": "Giving funding to the right people. I try to speak with all the grantees personally and I have a good idea of who will produce productive content based on previous experience. So the extra VP will be appreciated to get things moving forward for decentraland.\n\n#ButterForPresident"
  },
  {
    "address": "0xa4244F6711052752E6Bb0271Bf17c756E6598406",
    "bio": "Attended Berklee College of Music, founded Point Motion Inc., and soon after was named one of Boston's 'Top 25 Under 25' by The Improper Bostonian for my contributions to digital health innovation and public service.\n\nAfter being established as a prolific musician and creative problem solver, I led a team of talented individuals with the goal of improving the lives of people around the world through art and innovation; bringing music where people need it most.\n\nFounder of The Decentraland Report",
    "links": ["http://www.twitter.com/KevinOnEarth999"],
    "relevant_skills": [
      "Business Developement",
      "Music Composition & Production",
      "Product Design",
      "Community Building"
    ],
    "involvement": "Involved with DCL since 2017, first land purchase in Nov 2020, managing The Decentraland Report since January 2021",
    "motivation": "I'm already active in voting in the DAO and up to date with the latest in Decentraland. Through being a delegate I am to ensure the decentralized and creator empowered philosophy holds constant as we grow.\n\nImportant areas of DAO participation consists of everything from Grant, to POI proposals. In addition I aim to support proposals which promote accessibility, inclusivity, and diversity.",
    "vision": "In 5 years, we aim to see land filled with creative and meaningful experiences. Not created or managed by any single entity, the role of the DAO is to ensure the framework and points of DCL empower the creative community at large.",
    "most_important_issue": "Voting Power changes, land parcel increase, feature prioritization, and royalty distribution for marketplace"
  },
  {
    "address": "0x598f8af1565003AE7456DaC280a18ee826Df7a2c",
    "bio": "Experienced programmer.\nCoding decentraland scenes since 2019 and enjoying game jams.\nDedicated to decentraland as a community member full time since Mid 2021\n",
    "links": ["https://twitter.com/Pablo_es"],
    "relevant_skills": ["Programming"],
    "involvement": "Involved since 2019, always with long term view. Love to create.\nnow working with more people on @GolfcraftGame\n#VOXTERS\n(and quite other small projects)",
    "motivation": "In general, in favour of creators.\nSupport people who want to work and create and demonstrates it, to motivate the continuation of his work inside decentraland.\nI also do mistakes and I can change my mind from one day to other.",
    "vision": "Entertainment and opportunities for the users.",
    "most_important_issue": "How world see decentraland from outside.\nAlso patience, sometimes mine as well, good things need time."
  },
  {
    "address": "0x664EAbE08871a7b7f13AdE88bc34605ed5EAEAE6",
    "bio": "Hello, my name is Tobik and I upload YouTube videos and sell services to companies inside Decentraland. I have been creating content since May 2021 and my channel is one of the biggest inside the metaverse. I create videos about guides and help players to initiate in the game",
    "links": [
      "https://www.youtube.com/c/TobikCC/about",
      "https://discord.gg/wm6wAwZcyP",
      "https://twitter.com/TobikCC",
      "https://decentralfun.com/"
    ],
    "relevant_skills": ["Video production"],
    "involvement": "As I said before, I have been involved in Decentraland since May 2021. My videos have been helping many users to understand and get integrated into Decentraland. I also have produced content for brands such as DappCraft, BitBears, Rocking Uniquehorns and others.",
    "motivation": "I want communities to collaborate with each other. It helps the whole ecosystem.\nStop giving money to PayToWin stuff.\nMore games. People join more Decentraland when they have something to do.\nProjects that focus on giving tools and information to users to make them content creators as well.",
    "vision": "I think Decentraland will become the platform where any user will be able to meet others and interact with a bunch of experiences available for them. More people will understand the idea of decentralization because of the philosophy behind Decentraland and companies will collaborate here in good ways that we haven't seen in web 2.0.\n\nThe DAO will still fund projects and make sure that the values are persistent in time.",
    "most_important_issue": "Lack of games and 'things to do'\nLack of information that makes the game inaccessible for some people"
  },
  {
    "address": "0xb0145Ae156D201d6E371d07265FE3C045071c967",
    "bio": "Founder of OpenZeppelin and early contributor to Decentraland.",
    "links": ["https://twitter.com/maraoz"],
    "relevant_skills": ["web3", "programming", "security"],
    "involvement": "I've been involved with Decentraland since 2015, and was part of the team working on the early prototypes. I also chose the name 'Decentraland' and bought the domain originally. Recently I'm participating in DAO voting and I built https://genesis.city/, a map of Decentraland.",
    "motivation": "I want to provide oversight to grant requests, checking that money requested aligns to specifications and proposed schedule. I have lots of experience estimating timelines and bugdets of technical projects.",
    "vision": "I want to see the DAO gain more autonomy from the Foundation and start funding alternative clients and a constellation on projects adding value to the community. I'd also really love to see motorcycles and other vehicles added to Decentraland.",
    "most_important_issue": "The platform is way more powerful than most users know. Better communication and apps that index/explain the data and capabilities are needed."
  },
  {
    "address": "0x895Be97bDb9F8a244c472B18EA96DeE39ddf8fe5",
    "bio": "I'm Dax and I've been lucky enough to see DCL grow from the genesis auction to where it is now. Working the with SDK has become a part of my daily workflow and I'm getting involved in more and more projects related to DCL. I try to be active in the DAO and vote regularly!",
    "links": ["https://dcl-property.rentals/", "https://mckenna.dcl.eth/"],
    "relevant_skills": [
      "web3",
      "webdev (particularly backend using ruby and javascript)",
      "SDK experience",
      "product/project management",
      "community moderation",
      "knowledge of the DCL ecosystem"
    ],
    "involvement": "I've been involved in DCL since 2017 and am a contributor to the conference center district. I've built various scenes and been involved in several projects in that time, and have more recently been working on a simple rental platform for my own lands and working with 3pass on a free-to-use statistics platform",
    "motivation": "I have a decent size amount of VP and vote frequently. I also have a lot of experience with community moderation and try to be consistent with my voting patterns in terms of what i vote for or against:\n\nmaximize small grants to content creators and new project ideas that bring something fresh or are a benefit all users\nminimize the number of large grants (150k+) unless it is something very special\nminimize grants to teams/companies who will simply build a product for profit. the DAO is not a VC group.\nI try to communicate with grant makers and don't just vote yes or no without asking questions",
    "vision": "DCL is the Ethereum of metaverses in my opinion. It is leading the way with the most advanced tools and the best community and the DAO is part of this. As a community we have the power to drive huge and positive change for all users which is why I am so focused on informed voting",
    "most_important_issue": "Getting creative tools in the hands of people - and with the help of the dao and 3rd party teams and projects this is already happening. I've watched DCL explode in 2021 with many new games and ideas driven by progress in the usability of the SDK. I'm so excited for what the next years will bring!"
  },
  {
    "address": "0x247e0896706BB09245549E476257A0A1129db418",
    "bio": "I have been in IT since 2015, in web3 since 2017. Have led many web2 projects including mobile games,now I am running a new web3 project NIT - a DAO constructor.",
    "links": ["http://www.twitter.com/web3nit"],
    "relevant_skills": ["Web3 marketing", "Business dev", "Product manager", "Community management"],
    "involvement": "Active DCL user since 2021, first land purchase in Apr 2022",
    "motivation": "First of all I love Decentraland, it's the most important third party project for me, I care about it as much as of my child. DCL needs more positive changes and more activity. I am ready to boost it so that the ecosystem will benefit in the most efficient way.",
    "vision": "I see DCL as a world in which people will not only speculate and have fun but in which they call live their full-value virtual life. Real estate,dating,mining,shopping,software development,etc - must be easy accessible,clear and safe. DAO must play vital role in it, most important is must be active and competent.\n\nBriefly on steps:\n\nImprove performance and client compatibility\nHold elections with clear quarterly kpi's of mayors, if they not achieve them - ban and re-elections\nMore Decentralization\nAdd cars and punches :wink:\nCreate Decentraland wallet,defi with social network experience\nIntegrate VR\nOpen real life offices to represent DCL world,vision and swift brands integration",
    "most_important_issue": "First - DCL must be fast, without bugs and on most known platforms including MacOs and mobile. Second - it must be economically complete so that users will have the ability to find jobs,work,receive royalties etc. Third - more marketing activities to engage with new users and business. Fourth - scammers,it's a big problem,we must fight them with education and specialized software. Fifth- decentralization audit, what if web2 goes down, could we still play DCL ?\nI think we need a more active DAO with technical,economical,and marketing experts for full-time work with distinct kpis,reports and responsibility."
  }
]
