[
  {
    "address": "0xc1b8662A68F3eb66bC5e5C4DE7C1EF04Dc344d53",
    "bio": "I've been a DCL SDK developer for over a year and am an active member on discord. I attend every Townhall meeting and act as a mentor in the #sdk channel regularly. I host a weekly SDK meetup group every Wednesday where I teach people how to build in decentraland. I build every day, even weekends.",
    "links": [
      "https://www.youtube.com/channel/UCeV8zMwwclJX7Bf-JdxdJxw",
      "https://www.npmjs.com/package/dclconnect",
      "https://www.meetup.com/ethbuilders/events/mfcsrsydcdbfb/"
    ],
    "relevant_skills": [
      "Fullstack web developer (API/UI/Devop)",
      "Graphic designer",
      "3d modeler",
      "SDK mentor",
      "Grant Beneficiary"
    ],
    "involvement": "I work in decentraland all day to some degree. I'm either working on blockchain projects or building utilities/tools or training people in building. I consult with many metaverse companies and champion dcl to people who are skeptical.\n\n(How long have you been involved? How did you contribute?)\nOver a year or so. I'm very active in the community. Message me on discord!",
    "motivation": "I have an intimate understanding of building in dcl and have a great understanding of what effort is needed to achieve certain proposals. I'm also a dcl player, so I know what things have been attempted in the past and I pay attention to upcoming technologies that may be interesting/useful to implement into decentraland.\n\n(What kind of changes do you want to promote in the DAO? What's important to you?)\nFairness and freedom are critical. A healthy community that can build together. I enjoy networking people so they can collaborate instead of compete. I think these principals are important to the long term success of dcl.",
    "vision": "I'd like to see DCL become a place where users explore and create content in a censorship free and constantly improving/evolving ecosystem. Adopting new technologies in meaningful ways so that it's always competing for the top spot as a metaverse destination.\n\n(What do you want to see? What is the role of the DAO in it?)\nThe DAO is great for issuing grants that can have a meaningful impact on the community as a whole, and the polls are important to gauge community interest as well as help steer the development roadmap in a more accessible/future-proofed direction for everyone.",
    "most_important_issue": "Creating content is challenging. It should be much simpler and more fun to do. With more content there will be more users. Content in any form, 3d models, games, video streams, ect. 'If you build it, they will come.'\n\n(What challenges will we face in the next 12 to 24 months?)\nOther metaverses will slowly gain attraction due to having better graphics capabilities or easier content creation processes. At least temporarily. It will be important for dcl to leverage as many cool and interesting (open sourced) technologies as possible to keep pace with them. Although in the end, I believe dcl will win out as it's the linux of metaverses."
  },
  {
    "address": "0x3fB38CEe8d0BA7Dcf59403a8C397626dC9c7A13B",
    "bio": "Hi! My name is Avi but most people around here call me Morris. Came to Decentraland having been in the crypto space since 2016. Im a big fan of buffalo chicken wraps and I like to program stuff.",
    "links": [],
    "relevant_skills": [
      "Web3/solidity developer",
      "web2 full stack developer",
      "DCL sdk developer",
      "data hoarder",
      "grant beneficiary"
    ],
    "involvement": "Joined the Decentraland community at the beginning of January 2021. The open source nature of the project allowed me to jump in and start participating in my own way, no permission needed. Set out to become a data provider in the Metaverse, making use of the data streams from Decentraland to produce meaning analytics for different organizations in the community.\n\nWhen the new snapshot voting space for the DAO was established, I realized there were ways beyond programming that I could contribute to Decentraland. I am an active participant in the DAO discussions in discord and on the forum.\n\nI am developer with Atlas Corporation, a web3 development group started within Decentraland. Our team works closely with many different groups around Decentraland to provide infrastructure, smart contract development, and analytics.",
    "motivation": "I am a big believer in voter power delegation and the idea of liquid democracy. This drove me to submit the original proposal to bring delegation to the Decentraland DAO. Immediately following its implementation, I posted about being a candidate for delegation and was asked this same question. I had trouble answering this question at the time, because I still didn't understand what the DAO really was, what it could do, or how power it can be. I just knew that I was willing to put in the time, and make DAO participation part of my normal routine.\n\nOver the last 8 months, my reasons for wanting to be a delegate have become clearer to me. First and foremost, I live and breathe Decentralization above all else. This acts as a guiding light in my decision making. Delegation, by its very nature, while seemingly an act of centralization, allows for the decentralized pooling of voting power based on trust, and provides a force to equate the masses voting power with that of the powerful few who possess consolidated voting power.\n\nAnother foundational value that guides my decision making is the protection of the assets of Decentraland, across the whole stack. This means maintaining the integrity of the smart contracts that govern land and estates, names, wearables, and how they trade within the platform. Making sure Decentraland remains true to its open source nature is of vital importance to me.\n\nRegardless of your delegate selection, I encourage you to participate in the delegation process if you are not an active participant in the DAO. Unlock the VP and allow for more meaningful outcomes for the Decentraland community.",
    "vision": "Its hard to imagine where we will be in 5 years as that seems to be an eternity in this space. I'd like to see many independent development teams form and start working on DAO funded projects, further moving Decentraland towards decentralized development. With that, I would love to see the DAO have a functional delegation program, and possibly introduce categorical delegation to elevate experts in their respective fields.\n\nI predict we will see multiple clients introduced, free and paid, 2d and VR. Having multiple clients connect to the same content servers will begin to highlight the protocol nature of Decentraland rather than looking at it like a centralized game controlled by one group. Options are good and healthy, and ideally drive forward innovation.\n\nDecentraland will stand alone in the next 5 years as 100s of centralized 'Metaverses' are realized. Slow and steady wins the race.",
    "most_important_issue": "Over the next 24 months, I expect to see a few issues come to light, specifically mana tokenomics, land contract integrity, copyright infringements, adult content, and gambling. The Mana tokenomics, a deflationary currency, is at odds with the use case. Its predictable that with mana/USD movements, DCL citizens immediately call for the repricing of goods and services. As we travel further down this path, we need to add stability to our ecosystem. Something will need to be done to address this issue so that we don't get bogged down in repricing at every corner. We should be building, not retracing our steps constantly. I have some suggestions here but don't want to drift to far down that path in this forum.\n\nThe second issue we will face repeatedly over the next 24 months is changing the land contract, either for lost land or to expand the map. With a fixed number of parcels and rising market, there will be calls from current or newer DCL citizens who did not purchase land early to add parcels in the name of fairness and equality. We will also be faced with the lost land discussion a few times. We need to hold strong. Social pressure to change can be overwhelming but we are here because we believe in blockchain and immutability. We cannot sacrifice all we have worked towards.\n\nThird issue we will bump into is how decentralization is at odds with copyright infringements. Any scene owner can import any content, regardless of who owns it. Traditional brands typically have the legal rails to deal with this issue. Decentralizing the servers makes the process of a DMCA takedown extremely complicated if not impossible. While I am in favor of decentralization and all the disruption it brings, such systems will be in the spotlight over the next 24 months as traditional brands begin entering the space.\n\nNot much adult content on the platform currently and you have to know where to look to find it. As more people join Decentraland, that niche will grow larger. Decentraland does not have any real way, nor should it, to verify age. Coupled with the decentralization of the servers, adult content on the Decentraland platform could pose a problem in meeting the laws of all the countries in which these servers are accessible. Regardless of Terms of Service on the use of the client and or the servers, this will still be an issue that needs to be confronted.\n\nThe last issue for Decentraland will be gambling and how it meets global regulation. With my experience over the past year, I can assure you that more gaming is coming to the Metaverse. Reegulators haven't done much on this front and the organization's in Decentraland are adapting ahead of any issues, but I could see this entering the news cycle, with the citizens of DCL having to defend that Decentraland does not exist solely for gambling."
  },
  {
    "address": "0x76fb13f00CdbdD5eAC8E2664CF14be791aF87cb0",
    "bio": "Currently serve as the DCL DAO Facilitator, and in the process of launching Sanctuary DAO, a Conscious DAO-Building DAO for Stewardship of Organizations that are committed to and will build more preferable futures. Recently co-designed Big Green DAO and am operationalizing Big Green DAO a first of its kinda giving DAO that aims to democratize and decentralize philantropy. Currently a Future Studies PhD Candidate, researching Democratic and Decentralized Futures.",
    "links": ["https://dao.biggreen.org/", "https://twitter.com/MetaMatimio"],
    "relevant_skills": [
      "Anticipatory Governance Design",
      "DAO Design",
      "Governance Facilitation",
      "Monitoring and Evaluation",
      "OSINT"
    ],
    "involvement": "Currently DAO Facilitator & Member of Last Slice Collective\n\n(How long have you been involved? How did you contribute?)\n1 year. Do my best to facilitate governance and help community members express their interests as policy, and the DAO committee respond to and implement this policy to the best of our abilities.",
    "motivation": "Increase voter participation in the DAO, increase my ability to bring voting power to important community interests to make sure our voice is heard to the fullest extent possible. We are the future of the DAO and our DAO will only be successful to the extent that we participate in it, and take a stewardship role over its continued growth. I am committed to the success of our social experiment and foresee myself being an very longstanding member of the DCL DAO and broader DCL Community.\n\n(What kind of changes do you want to promote in the DAO? What's important to you?)\nMake our governance structures as robust, representative and sustainable over the long term as possible. There is no one specific policy I want to see changed, rather I am committed to our policies as a whole circulate and regulate power in a way that prevents over centralization to the extent that our mission is diluted and hyper-decentralization to the extent that we are not able to get anything done.",
    "vision": "Active and engaged DAO community, with functional and battled tested governance structures capable of responding to changing circumstances and dynamics in the Metaverse and IRL as the web3, NFT and metaverse spheres expand and increasingly take on mainstream adoption.\n\n(What do you want to see? What is the role of the DAO in it?)\nIt is front and center in this vision =).",
    "most_important_issue": "Governance =).\n\n(What challenges will we face in the next 12 to 24 months?)\nGrowth. Competition. Competing interests and the need to develop structures that are both flexible and agile, yet secure and able to provide a foundation for stable governance of our metaverse world."
  },
  {
    "address": "0x9A739c2e212754c3d8432CB717dC9437e5b3Dfae",
    "bio": "My name is Sean Ong and I am based in Seattle, USA. I am an avid VR/AR developer and entrepreneur that has founded several metaverse companies. A long-time investor in $MANA and huge proponent of Decentraland, I have recently been deeply involved with Decentraland development, bringing VR support and immersive building support to the DCL platform.",
    "links": [
      "https://github.com/mr0ng",
      "https://www.linkedin.com/in/seanong/",
      "https://www.xrdevstudio.com/",
      "https://www.youtube.com/c/seanong"
    ],
    "relevant_skills": ["AR and VR Dev", "Unity", "Management", "Finance", "Economics", "Business"],
    "involvement": "Decentraland DAO Grant Recipient\n\nCurrently leading team to develop VR play+building support for Decentraland\n\nEngaged with Decentraland community on Discord and Reddit",
    "motivation": "As a proponent of Decentraland and also someone who is invested in Decentraland, I would like to represent those who are also invested in Decentraland. I would like to vote on proposals that would enhance and grow Decentraland, thereby generating value for all VP stakeholders. Similarly, I would like to vote against proposals that would harm Decentraland or that would have negative impacts to the future growth of Decentraland.",
    "vision": "I see Decentraland being the top Metaverse platform for the foreseeable future. I do consider it to be the top metaverse today. As spatial computing and XR devices become more ubiquitous over the next 5 years, I see the metaverse becoming increasingly important in our daily lives and for our livelihood. My vision is that within 5 years, Decentraland will be a primary income source and economic powerhouse for millions of people around the world, and will be a forerunner in the decentralized global economy.",
    "most_important_issue": "I think the most important issue is that we avoid Decentraland becoming trapped in age-old issues that has plagued governance throughout human history. Corruption, politics, unfairness, injustice, censorship, excess regulation, and other topics will be easy for Decentraland to fall into. Instead, we need to learn from history to guide Decentraland and not let Decentraland 'run its course.' It's not an easy problem to solve, but I believe it's the most important for a healthy economy and will require all of us working together to build a better system that provides opportunities for all people, both rich and poor."
  },
  {
    "address": "0xCF10CD8B5Dc2323B1eb6de6164647756BAd4dE4d",
    "bio": "I am an interactive media creator building Golfcraft in Decentraland, and exploring Artificial Intelligence applied to virtual beings.",
    "links": ["https://twitter.com/EibrielBot"],
    "relevant_skills": ["web3", "programming", "community moderation"],
    "involvement": "I've been involved since 2020, a couple of months after public launch. Since then I've been developing games and experiences. I'm currently one of the Developers of the game Golfcraft, and the virtual pet Compicactus.\n\nGolfcraft is currently being funded by grants from the DAO.",
    "motivation": "I'm looking to help fund amazing creators. We need more content to attract and retain users. And more tools to help build.",
    "vision": "In 5 years Decentraland should be a place to make friends, make business and share ideas. It should be a complete social network, with interconnected experiences (some of them sponsored by big brands), and multiple clients (browser, desktop, mobile, VR).\n\nThe role of the DAO will be to steer the development, allowing Decentraland to accommodate to the changes in technology and user preferences.",
    "most_important_issue": "External challenges:\n\nFUD: Decentraland needs a strong communication strategy to share its vision\nTechnology limitations to be decentralized and remain competitive.\nInternal challenges:\n\nDifficulty to communicate its vision in a consistent and frequently: needs some extra PR work\nCurrent social tools are limited (chat, moderation)\nAlthough much improved, user self expression is still restrained: DCL needs more ways to allow users to make the world their own."
  },
  {
    "address": "0xB2223F4038DEf8A62a86E3c4b108CDfE00a74C4f",
    "bio": "It's butter! That guy that actively lurks in the discord/telegram' Mainly #SDK, #DAO, #LAND and #GENERAL. I've built a few events for different projects through the SDK. With favorites such as Keep network, realfake, astar and unbanked.",
    "links": ["https://github.com/ERC20s"],
    "relevant_skills": ["Web3", "solidity", "js", "ts", "wss", "sdk", "blender"],
    "involvement": "I've been around since Nov 2019. Hosted my first event for keep network around june 2020. RealFakeBrand was around March 2021' Astar plot was deployed in december 2021' Now Unbanked is live at the moment and will probably stay live for a while here: https://play.decentraland.org/?island=I1dkmo&position=-137,-24&realm=loki",
    "motivation": "I generally give my votes for teams that I feel will benefit the game. And I don't support projects that just benefit the grantee. I'm also declaring myself a full-time metaverse guy now so it would be good to have some extra VP'",
    "vision": "I really want to see more top brands coming in and bringing more active users. I'm going to be working full-time with unbanked and astar to bring more products, events and games'",
    "most_important_issue": "Giving funding to the right people. I try to speak with all the grantees personally and I have a good idea of who will produce productive content based on previous experience. So the extra VP will be appreciated to get things moving forward for decentraland.\n\n#ButterForPresident"
  },
  {
    "address": "0xa4244F6711052752E6Bb0271Bf17c756E6598406",
    "bio": "Attended Berklee College of Music, founded Point Motion Inc., and soon after was named one of Boston's 'Top 25 Under 25' by The Improper Bostonian for my contributions to digital health innovation and public service.\n\nAfter being established as a prolific musician and creative problem solver, I led a team of talented individuals with the goal of improving the lives of people around the world through art and innovation; bringing music where people need it most.\n\nFounder of The Decentraland Report",
    "links": ["http://www.twitter.com/KevinOnEarth999"],
    "relevant_skills": [
      "Business Developement",
      "Music Composition & Production",
      "Product Design",
      "Community Building"
    ],
    "involvement": "Involved with DCL since 2017, first land purchase in Nov 2020, managing The Decentraland Report since January 2021",
    "motivation": "I'm already active in voting in the DAO and up to date with the latest in Decentraland. Through being a delegate I am to ensure the decentralized and creator empowered philosophy holds constant as we grow.\n\nImportant areas of DAO participation consists of everything from Grant, to POI proposals. In addition I aim to support proposals which promote accessibility, inclusivity, and diversity.",
    "vision": "In 5 years, we aim to see land filled with creative and meaningful experiences. Not created or managed by any single entity, the role of the DAO is to ensure the framework and points of DCL empower the creative community at large.",
    "most_important_issue": "Voting Power changes, land parcel increase, feature prioritization, and royalty distribution for marketplace"
  },
  {
    "address": "0x598f8af1565003AE7456DaC280a18ee826Df7a2c",
    "bio": "Experienced programmer.\nCoding decentraland scenes since 2019 and enjoying game jams.\nDedicated to decentraland as a community member full time since Mid 2021\n",
    "links": ["https://twitter.com/Pablo_es"],
    "relevant_skills": ["Programming"],
    "involvement": "Involved since 2019, always with long term view. Love to create.\nnow working with more people on @GolfcraftGame\n#VOXTERS\n(and quite other small projects)",
    "motivation": "In general, in favour of creators.\nSupport people who want to work and create and demonstrates it, to motivate the continuation of his work inside decentraland.\nI also do mistakes and I can change my mind from one day to other.",
    "vision": "Entertainment and opportunities for the users.",
    "most_important_issue": "How world see decentraland from outside.\nAlso patience, sometimes mine as well, good things need time."
  },
  {
    "address": "0x664EAbE08871a7b7f13AdE88bc34605ed5EAEAE6",
    "bio": "Hello, my name is Tobik and I upload YouTube videos and sell services to companies inside Decentraland. I have been creating content since May 2021 and my channel is one of the biggest inside the metaverse. I create videos about guides and help players to initiate in the game",
    "links": [
      "https://www.youtube.com/c/TobikCC/about",
      "https://discord.gg/wm6wAwZcyP",
      "https://twitter.com/TobikCC",
      "https://decentralfun.com/"
    ],
    "relevant_skills": ["Video production"],
    "involvement": "As I said before, I have been involved in Decentraland since May 2021. My videos have been helping many users to understand and get integrated into Decentraland. I also have produced content for brands such as DappCraft, BitBears, Rocking Uniquehorns and others.",
    "motivation": "I want communities to collaborate with each other. It helps the whole ecosystem.\nStop giving money to PayToWin stuff.\nMore games. People join more Decentraland when they have something to do.\nProjects that focus on giving tools and information to users to make them content creators as well.",
    "vision": "I think Decentraland will become the platform where any user will be able to meet others and interact with a bunch of experiences available for them. More people will understand the idea of decentralization because of the philosophy behind Decentraland and companies will collaborate here in good ways that we haven't seen in web 2.0.\n\nThe DAO will still fund projects and make sure that the values are persistent in time.",
    "most_important_issue": "Lack of games and 'things to do'\nLack of information that makes the game inaccessible for some people"
  },
  {
    "address": "0xb0145Ae156D201d6E371d07265FE3C045071c967",
    "bio": "Founder of OpenZeppelin and early contributor to Decentraland.",
    "links": ["https://twitter.com/maraoz", "https://maraoz.com/2022/05/04/decentraland-vision/"],
    "relevant_skills": ["web3", "programming", "security"],
    "involvement": "I've been involved with Decentraland since 2015, and was part of the team working on the early prototypes. I also chose the name 'Decentraland' and bought the domain originally. Recently I'm participating in DAO voting and I built https://genesis.city/, a map of Decentraland.",
    "motivation": "I want to provide oversight to grant requests, checking that money requested aligns to specifications and proposed schedule. I have lots of experience estimating timelines and bugdets of technical projects.",
    "vision": "I want to see the DAO gain more autonomy from the Foundation and start funding alternative clients and a constellation on projects adding value to the community. I'd also really love to see motorcycles and other vehicles added to Decentraland.",
    "most_important_issue": "The platform is way more powerful than most users know. Better communication and apps that index/explain the data and capabilities are needed."
  },
  {
    "address": "0x895Be97bDb9F8a244c472B18EA96DeE39ddf8fe5",
    "bio": "I'm Dax and I've been lucky enough to see DCL grow from the genesis auction to where it is now. Working the with SDK has become a part of my daily workflow and I'm getting involved in more and more projects related to DCL. I try to be active in the DAO and vote regularly!",
    "links": ["https://dcl-property.rentals/", "https://mckenna.dcl.eth/"],
    "relevant_skills": [
      "web3",
      "webdev (particularly backend using ruby and javascript)",
      "SDK experience",
      "product/project management",
      "community moderation",
      "knowledge of the DCL ecosystem"
    ],
    "involvement": "I've been involved in DCL since 2017 and am a contributor to the conference center district. I've built various scenes and been involved in several projects in that time, and have more recently been working on a simple rental platform for my own lands and working with 3pass on a free-to-use statistics platform",
    "motivation": "I have a decent size amount of VP and vote frequently. I also have a lot of experience with community moderation and try to be consistent with my voting patterns in terms of what i vote for or against:\n\nmaximize small grants to content creators and new project ideas that bring something fresh or are a benefit all users\nminimize the number of large grants (150k+) unless it is something very special\nminimize grants to teams/companies who will simply build a product for profit. the DAO is not a VC group.\nI try to communicate with grant makers and don't just vote yes or no without asking questions",
    "vision": "DCL is the Ethereum of metaverses in my opinion. It is leading the way with the most advanced tools and the best community and the DAO is part of this. As a community we have the power to drive huge and positive change for all users which is why I am so focused on informed voting",
    "most_important_issue": "Getting creative tools in the hands of people - and with the help of the dao and 3rd party teams and projects this is already happening. I've watched DCL explode in 2021 with many new games and ideas driven by progress in the usability of the SDK. I'm so excited for what the next years will bring!"
  },
  {
    "address": "0x247e0896706BB09245549E476257A0A1129db418",
    "bio": "I have been in IT since 2015, in web3 since 2017. Have led many web2 projects including mobile games,now I am running a new web3 project NIT - a DAO constructor.",
    "links": ["http://www.twitter.com/web3nit"],
    "relevant_skills": ["Web3 marketing", "Business dev", "Product manager", "Community management"],
    "involvement": "Active DCL user since 2021, first land purchase in Apr 2022",
    "motivation": "First of all I love Decentraland, it's the most important third party project for me, I care about it as much as of my child. DCL needs more positive changes and more activity. I am ready to boost it so that the ecosystem will benefit in the most efficient way.",
    "vision": "I see DCL as a world in which people will not only speculate and have fun but in which they call live their full-value virtual life. Real estate,dating,mining,shopping,software development,etc - must be easy accessible,clear and safe. DAO must play vital role in it, most important is must be active and competent.\n\nBriefly on steps:\n\nImprove performance and client compatibility\nHold elections with clear quarterly kpi's of mayors, if they not achieve them - ban and re-elections\nMore Decentralization\nAdd cars and punches :wink:\nCreate Decentraland wallet,defi with social network experience\nIntegrate VR\nOpen real life offices to represent DCL world,vision and swift brands integration",
    "most_important_issue": "First - DCL must be fast, without bugs and on most known platforms including MacOs and mobile. Second - it must be economically complete so that users will have the ability to find jobs,work,receive royalties etc. Third - more marketing activities to engage with new users and business. Fourth - scammers,it's a big problem,we must fight them with education and specialized software. Fifth- decentralization audit, what if web2 goes down, could we still play DCL ?\nI think we need a more active DAO with technical,economical,and marketing experts for full-time work with distinct kpis,reports and responsibility."
  },
  {
    "address": "0xe400a85a6169bd8be439bb0dc9eac81f19f26843",
    "bio": "Innovation dev that gets interested when others say it can’t be done. Business development, devops, and exploratory forays at Atlas Corp. I do math all day and like it. Chicken farmer and maintainer of reddit’s chicken identification bot. Building toward a future where robots are people too.",
    "links": ["https://www.reddit.com/user/bawkbawkbot/", "https://twitter.com/RobSeidman"],
    "relevant_skills": [
      "Corporate business development on very technical subjects",
      "Large-scale cloud infrastructure (e.g. k8s, docker, CI/CD)",
      "web3 full stack programming",
      "technical blogging"
    ],
    "involvement": "I showed up in Feb/March 2021. I only own a few plots of land myself, but have helped several DCL communities build the tech out for their communities (see Atlas Corp client roster). Lead dev on Decentralandalytics, & custom analytics for brands entering DCL.",
    "motivation": "My point of view on issues is usually predictable and transparent (and when an issue is important to me I tend to get loud on the forums as many of you likely know). Folks can delegate to me without worrying I’ll vote in an unexpected way.\n\nAs an example of a core belief, I believe the DAO needs to fund more strategic endeavors to create revenue streams to make the DAO treasury more self-sustaining. I also believe this is the way to continue to run a decentralized ecosystem in perpetuity.",
    "vision": "Decentraland needs to lead by example of how to run a true DAO and decentralized community. They need more builders and passionate individuals to be a part of the ecosystem as the web2 world starts to show its cracks. The [forthcoming] introduction of VR access will be a game changer (pun intended) and DCL needs to be able to handle the ensuing exponential growth of its user base with folks not previously versed in crypto or blockchain, as well as corporations, without having to sacrifice any of its core values.\n\nI also think the community should work toward the DAO operating more as a headless business such that the treasury grows and can make continued investment over time. For example, at some point I may draft a proposal that outlines how the DAO can collect and sell analytics data instead of third parties.",
    "most_important_issue": "There is a bit of a lack of a strategic cohesion across the DCL community - I would like to see more initiatives that promote everyone contributing to a common narrative. The metaverse fashion show is a great example of what this could look like. As much as everyone can do whatever they want on their own land, greater things can be accomplished through collaboration.\n\nAlso, in the near future centralized metaverses may try to steal the spotlight with flashier graphics which could pivot some of the enthusiasm/funding DCL could use to grow. Many users not deeply involved may care less about decentralization and open source concepts until it’s too late."
  },
  {
    "address": "0xd41308f50858da2b7cc641e493fbddf34775393a",
    "bio": "Hey everyone! I’m ryan, kokesmush on all platforms and i’ve been an active member of decentraland for about 6 months now. I am a 3D builder as well as an NFT project creator. I help promote DCL events as well as work closer with the brands that host events.",
    "links": [
      "https://twitter.com/kokesmush",
      "https://instagram.com/kokesmushTV",
      "https://youtube.com/c/KokesmushOfficial"
    ],
    "relevant_skills": [
      "Social Media Marketer/Manager",
      "3D Modeler",
      "Scene Builder",
      "Event Promotion and Community Building"
    ],
    "involvement": "I’ve been an avid member of Decentraland for about 6 months and am active daily even if I’m just AFKing. I’ve recently acquired some land and have deployed my scene and already have had my first event approved. The first of many. I love bringing people together and giving back to the community. I’m actively on multiple platforms learning more about what I can do to integrate people into web3",
    "motivation": "I believe in the power of the people, and when only a select few have majority of the VP, the power isn’t with the people, but rather the chosen few that control the sway in decisions. I believe in democracy and an equal opportunity for all creators to prove themselves. I was thrilled to see there was an active seeking for new delegates as I consider myself to play an active role in the community. I’m not anybody super famous or important, but I like to think that I could help me a positive difference in DCL.",
    "vision": "My 5 year vision for DCL would be to keep on growing as steadily and positively as possible with the pace of web3. There are tons of projects coming out that are doing the same thing or offering the same thing, we really need to get behind people and projects that are doing big things and paving the way for the metaverse and web3 as a whole. I think there will be more complex companies coming to DCL that would require more of an adept foundation of support and I feel the DAO could play a vital part in making that possible.",
    "most_important_issue": "I think the most important issue about DCL is the lack of education. People come into DCL via web browser or desktop client, and they’re pretty much just thrown in forced to figure things out for themselves or hope someone comes along and shows them a thing or two. There are plenty of YT videos out there (I have made a couple myself) that educate the newer players, but there isn’t really an educational standpoint about DCL to newer users. That’s only one problem. Another problem I see is projects with tokenomics that might include approved wearables into their tokenomics allowing users to feel the token has a monetary value. This needs governance."
  },
  {
    "address": "0xAeD753D90b7C88103Fbee3Bf90DA4436C326D9E1",
    "bio": "Hi! I’m Gabriel Ribeiro, but people know me as Metacrowner.I have a degree in information systems and always worked in the area of systems and marketing. Atm I’m working with the VR technology to metaverse and developing mobile games",
    "links": ["https://twitter.com/MetaCrowner"],
    "relevant_skills": [
      "community leader and moderator",
      "Crypto investor",
      "Android and IOS game developer",
      "translator",
      "good network if big brands",
      "VR and metaverse promoter"
    ],
    "involvement": "I showed up in December 2021. Im wearable creator with partners from Brazil and Europe, but have helped several DCL communities build the tech out for their communities (see BlockXwearables, Zero2hero, Metawear).I’m Decentraland Reporter and promoter for brands entering DCL.",
    "motivation": "I want to get a higher value on my point of view of DAO proposals, taking the voice of my own community and my knowledge to decide the votes weekly on my twitch stream",
    "vision": "I fell like in 5 years decentraland gonna be one of the most important metaverse in the world, growing how the community choose on a space with freedom of speak and democracy.\n\nI hope that we can build a community connect without any kind of discrimination or social separation",
    "most_important_issue": "Actually on my point of view we don’t have enough people interested in the DAO and how does it work, this make the DAO don’t work like it’s built for, we need more people delegated working on the vote system daily and showing it to the community.\n\nDecentraland don’t have a big brand behind like Meta or Microsoft because it’s a decentralized organization, this way we must grow together as one community to show to the world that the community voice is louder then a enterprise.\n\nWe are late on Decentraland growing process because the actual miss information about the DAO, the way to get things approved or rejected isn’t fast enough to web3 competition."
  },
  {
    "address": "0xff3327cc139449fa111ad87351bb300e9cc7607c",
    "bio": "I’m XIII and I’ve been fortunate enough to find DCL and have it become part of my life. I’ve been designing parkour courses and learning how to implement new features using SDK. Can find me gainfully making lasting friendships with forward-thinking community members around DCL!",
    "links": ["https://twitter.com/Specimen_XIII", "https://www.instagram.com/specimenxiii/"],
    "relevant_skills": [
      "Community Management",
      "Scene Builder",
      "Parkour Course Creator",
      "Web3 Marketing",
      "Learning SDK",
      "DCL Inhabitant",
      "Insight"
    ],
    "involvement": "I’ve been having a blast all around Decentraland attending events and creating lasting relationships with the various denizens of Decentraland. DCL has truly become a part of my everyday life, whether that’s creating new and challenging parkour courses for various brands around the space or taking a look at the new proposals and questions in the forums. I’ve even begun reading posts long forgotten to catch up on the history of the DAO and learning about my fellow members of the space.\n\nIt’s an honor to even be considered for receiving a delegation and would humbly serve the DAO with however much were to be presented. I aim to serve the community and fairly using the VP that would potentially delegated.\n\nI think it’s been since Dec of '21 or maybe a little before, but I’ve sort of touched upon a little of how I have been involved, but my involvement continues to expand through various means in and out of Decentraland. I’ve met some wonderful people and have actively been bring more members to the space.\n\nI shall continue to onboard new creators that I come in contact with all the knowledge I’ve amassed along my short, but fulfilling journey.",
    "motivation": "I was actually reading a post that @yemel had commented on and there a link to this post was. I had seen it a few times when logging on, but hadn’t had the courage to make a post until reading that comment.: I believe delegation is a good way to give more voice to valuable members of our community. I took the time to review their applications and follow their participation in the government process. I encourage other big holders to do the same.\n\nSo thank you @yemel for your words, as they spoke volumes to me.\n\nThere’s nothing specifically that I wish to change, but what I want is more to the point of a voice within this community that I’ve become so enamored by. The success of the DAO is dependent upon the activity of it’s participants and only thrives properly with continued growth. I suppose that’s my goal in this matter, the continued and sustainable growth of Decentraland.",
    "vision": "With Decentraland being the top tier Metaverse at this time, I see it being growing exponentially in the coming months and years as we see VR coming to the forefront. The immersion will increase and therefore the amount of time spent within the world.\n\nI see more content being presented to the community and more of a cohesive society full of events and ways for the inhabitants to interact with one another.I see content being ever-increasingly important and believe we should do what we can to provide that content. I think it important that the DAO oversees the functionality of providing that future.",
    "most_important_issue": "I think that there are two issues currently plaguing Decentralnd at the moment and will continue to be issues until they are no longer such. Governance and Content, the growth of the platform depends upon both. It all starts with the DAO and the voices that give it power.\n\nThank you for your consideration"
  },
  {
    "address": "0x37F00ec67D68C2D3c662339C183D37403c36f28E",
    "bio": "Aside form being the #1 Waifu jpg king. Featured in Forbes, Fox News, Huffpost, Techrunch and more Aaron Leupp and his company PromoAffiliates is most famous for acquiring millions of new users and millions of influencer views for his clients",
    "links": ["https://twitter.com/aaronleupp", "www.aaronleupp.com"],
    "relevant_skills": [
      "Producing",
      "Business Development",
      "Marketing",
      "Waifu art",
      "Product Design",
      "Community Building",
      "Billion Dollar Unicorn Companies"
    ],
    "involvement": "Involved with DCL since Jan 2021, multiple Waifumon Parties a year in DCL since then!",
    "motivation": "I’m already active in voting in the DAO and up to date with the latest in Decentraland. Through being a delegate I am to ensure the decentralized and creator empowered philosophy and most importantly encourage innovation as we grow.\n\nImportant areas of DAO participation consists of everything from Grant, to POI proposals. I also want to encourage less unnecessary rules and gate keeping. People are turning this into homework and school and this is suppose to be fun. In addition I aim to support proposals which promote accessibility, inclusivity, and diversity. Yes I copied a lot of this from Kevin but am making it my own.",
    "vision": "It will be the lead Metaverse in web3 space because it will finally be more Decentralized.",
    "most_important_issue": "Increase in activity and events in Decentraland. Less restrictions, bureaucracy and gatekeeping in Decentraland. More encouragement continued innovation!"
  },
  {
    "address": "0x613e052555ac74FF6aF0FC64E40e8035C1E9DCf8",
    "bio": "DG Discord Support Admin & DCL Wearables Designer.",
    "links": ["https://twitter.com/crypt_sannin"],
    "relevant_skills": ["3d modeling", "community moderation"],
    "involvement": "Joined DCL about a year and half ago (on this address 0x4bCfB57149DD1E8eC510bc2CC490bC4C43C7Af8f before securing assets on a hardware wallet), after seeing an Ad from DG hiring for the positions of casino hosts. Quite interested in the metaverse, NFTs, P2E I started hopping around different venues around DCL like Wondermine, The Decentraland Report and Metazoo’s to name a few. Having no knowledge of wearables or even 3D modelling at all, became obsessed with wearables, joined a few groups, visited a few sites to gather info on these, created and submitted my first DCL wearable. Some of my contributions have been to continue publishing wearables, have minted a few names, collaborated with other community members on onboarding, wearables release, Parkour, events and giveaways. p.s very gratefull to all. Wearable references: https://forum.decentraland.org/t/collection-sannins-ninja-no-kunren-co-created-by-cryptsannin-is-ready-for-review/1707, https://forum.decentraland.org/t/collection-sannins-mummified-ninja-created-by-cryptsannin-is-ready-for-review/2259",
    "motivation": "The idea of delegation is very interesting to me, in this case the delegation of voting power with the intention of community involvement for its decision making and growth of platform helps with maintaning the integrity of the community as a whole. Although I participate in voting already. Reasons to be a delegate include supporting creator projects specifically building/developing DCL for the next users to come, involved with wearable making and community, have participated before (in other DAOs) and carry a nice understanding in general of these. Most importantly thinking on inclusivity and transparency by what it means to have more users debating and sharing ideas of growth.",
    "vision": "I see Decentraland as the most competent metaverse in Web3 currently, the possibilities/potential of creation and development that can merge are endless even with the many accomplishments DCL has been able to fulfill. I’d like to see the growth, we will witness in the years to come in DCL’s DAU, be accompanied with opportunities for those who are willing and devoted to keep providing value to the community. DAO’s role would still be to oversee these opportunities are not taken for granted, ensuring the treasury’s well being while development is prioritized and to provide an understanding of proposals enacted as well as trying to maintain inclusivity for DAO involvement for all members as more join. DCL progress so far since I joined has been more than outstanding, it’s difficult to think what could be going on in just 5 years. “Most people overestimate what can be done in 1 year and underestimate what can be done in 5 or 10”. Having this said, extremely bullish on DCL and my vision is DCL will grandfather metaverses as Bitcoin did for crypto currencies, in setting the standards of decentralization and possibilities.",
    "most_important_issue": "In my opinion the issue at hand is, users will keep joining we have seen and there’s not much one can do in DCL after some time.There’s an important question we must have in mind: What can we create for users to become involved with community as they enjoy DCL and keep logging in? DCL is the perfect platform for an “all-around” metaverse, for this we must maintain development diversity."
  },
  {
    "address": "0x6a77883ed4E65a1DF591FdA2f5252FD7c548f198",
    "bio": "I’m a 34 year old small business owner and a husband. I’m ‘dad’ to 4 beautiful dogs, 2 cats, and 3 chickens. – and a full time DCL community member striving to make a difference in the space. I spend 12+ hours in world.",
    "links": ["https://twitter.com/FancyDCL"],
    "relevant_skills": [
      "Twitch/Discord Moderation",
      "active Twitter spaces speaker",
      "community building both in game and on social media",
      "Wearables promoter and hoarder"
    ],
    "involvement": "I joined in January 2021, but I took a break for several months over the summer, have been a DAU (Daily Active User) since late November 2021. During my time here my primary focus has been onboarding and guiding new users and supporting our amazing creators. I sponsored the creation of the RGB Wings produced by @AnomalousLTD and co-hosting the launch party with @SinfulMeatStick. I’ve since attended hundreds of events and always try to give back (quietly) to the community.",
    "motivation": "My biggest goal and the reason for applying for delegation is to protect the integrity of the space, to help prevent the abuse of grant proposals, to onboard new users, and to help educate new and existing users on the risks and concerns relating to cyber security via passing of deserving educational programs and proposals. I also feel it’s important to improve the functionality and accessibility of tools such as the user interfaces both in game, builder, and marketplace.",
    "vision": "Where do I see Decentraland in 5 years… Well, that is kind of a loaded question, as this space evolves at a much more rapid pace than the real world or the world of web 2. I see DCL of tomorrow as an ever-evolving world of endless possibilities, with equal opportunity for everyone to create, learn, earn, and grow. It will become a social platform where literally anything is possible for those who are willing to put forth the work. When I think of the next five years, I envision a virtual world where millions of users are able to interact and and collaborate. Decentraland will not only be a social platform but almost a fully functioning society, complete with its on art, fashion, music, entertainment, education, and celebration. There will be lands people visit for work, for school, for play, and to earn a living. Most importantly it will be a world where everyone is welcome and can be accepted for who they are, regardless of race, religion, sexuality, or gender identity. Decentralization doesn’t necessarily have to mean a free for all with no rules where there is freedom of consequence. It should always remain a hub of freedom from censorship, limited only by the guidelines and expectations of the community.",
    "most_important_issue": "Currently, the most pressing matter in my opinion is the onboarding of new users, but additionally the accessibility for those who are passionate about the world to be able to build and create."
  },
  {
    "address": "0xc939519869C946E4BdCa8FD0B6459048c4aEBAe2",
    "bio": "I’m a K-8 Technology Specialist Educator. I teach children how to operate crypto-wallets, make NFTs, and build virtual spaces. Online since 1993 on the Mosaic browser. I create massive multiplayer performance art like https://return2.me 1, sketch-it: August 2006, and Flowers of Light and Love on Vimeo 1. I lead with my heart into spaces where genuine, human, interconnection is the goal.",
    "links": [
      "https://twitter.com/awedjob",
      "https://github.com/awedjob",
      "https://www.linkedin.com/in/affirmative/",
      "https://affirmative.org"
    ],
    "relevant_skills": [
      "Entrepreneur",
      "Creator",
      "Hosted - multiple events in Decentraland",
      "Moderator",
      "Director",
      "Educator",
      "Project Manager",
      "Animator",
      "Producer",
      "Future Problem Solver trainer",
      "Discord Admin"
    ],
    "involvement": "I arrived in December 2021. Actively posted about my first time wearable creation experience in the forum (link) 1. Posted a poll about increasing the facial diversity of avatars in DCL that was rejected (link). I listen to and participate in at least 4 Twitter spaces about DCL each week. I will re-listen to the spaces and annotate the discussions by tweeting the time stamp and a description of topic. In partnership with Wisher Vodka and nine other land owners I hosted a scavenger hunt called “Finding Whimsy”. Nearly 30 people participated for over 3 hours. They solved clues and followed instructions leading them all over Decentraland. Everyone who figured out they needed to go to Asian Plaza on the Artemis server and found the faerie queen, Whimsy, won a variety of prizes like the Spotlight emote and wearables from a number of talented creators. I am one of three co-hosts of ABC Decentraland Adventures (created by BillyTeacoin), a weekly guided tour of new and interesting places streamed on Twitch. We talk to the owners, developers, and animators who work to create a richer experience. After streaming two hour episodes for eight weeks, we have toured 47 different locations with an average of 30 visitors joining us in world.",
    "motivation": "I will be the voice of the hundreds of thousands of krill to balance out the few whalesI am a bridge between brand new users and daily active users who have been around since DCL pixels first hit the eyeballs of the public. I take the time to meet new people visiting Decentraland for the first time. I answer their questions and give them small tasks to complete so they can learn by experience. We keep communicating via Twitter, Telegraph, and Discord. We plan outings to learn and have fun. I seek out existing users and learn about their contributions. I ask them what their plans are for the future of this space. Encourage people to start doing things rather than looking for DAO approval. Money is only one resource needed to actualize a dream. Creativity and hard work are good substitutes for under-funded visionaries. Explore a reputation-based VP for voting. The people who spend the most time in the world building, developing, creating, socializing, and networking gain VP to vote on changes. There are more kinds of capital than crypto. I’d like to include experience, knowledge, wisdom, and time as factors in calculating voting power. I’d like the DAO to be more representative of the people that visit DCL. I’d like the people who visit DCL to look more like the citizens of the world.",
    "vision": "Encourage a million flowers to bloom. Free “experimental” land for everyone to play with and learn how to build and develop using the SDK. Extensive and up-to-date docs and video tutorials in multiple languages. People need to be able to see themselves in the virtual realm before they will want to enter it. Increase the diversity of facial characteristics, body types, genders, and body abilities of the avatars. Utilizing IPFS to store and serve assets for DCL. This will truly decentralize and make more sturdy the content of the world. Spinning up a Catalyst server on AWS still puts us in the realm of single point of failure. (What do you want to see? What is the role of the DAO in it?) The DAO’s role is to support the community in their projects and to get out of the way the rest of the time. Not to insert itself everywhere but only in places that it can accelerate a process or add value.",
    "most_important_issue": "Increasing and retaining Daily Active Users. (What challenges will we face in the next 12 to 24 months?) The fiat to Mana bottleneck is limiting the flow of capital into Decentraland. Are we going to continue telling the new potential user, “No. Sorry. We don’t want any of your money.”? After a person can see themselves in a world, they want to own a piece of that world. If we put a huge wall in the way of everyone wanting to get their own piece, they will leave and take their money with them. That piece can be as simple as buying a hat in the marketplace."
  },
  {
    "address": "0xd6eFf8F07cAF3443A1178407d3de4129149D6eF6",
    "bio": "Hi! I’m Canessa and I’ve been a Decentraland citizen since 2019. I’ve been a land owner for over 3 years, and I was a winner of the first Land Creator Contest in 2019. More recently I’ve been working to grow Decentraland and hope to inspire others to do the same.",
    "links": [
      "https://twitter.com/CanessaDCL",
      "https://instagram.com/canessaDCL",
      "https://events.decentraland.org/event/?id=ddcf355b-6fd6-41b5-9f0c-46a3d7f824a5",
      "https://steamworksdecentraland.blogspot.com/?m=1"
    ],
    "relevant_skills": ["Psychology", "Education", "Behaviorism", "3D Modelling"],
    "involvement": "I first bought Mana in 2018, and jumped fully into Decentraland with the Land Creator Contest in the spring of 2019. I was one of the 50 winners, and my winning scene is permanently displayed at -111, 57. After the contest I began buying land to build on, and I was one of the first 1,000 users to ever open a Decentraland account. This year I’ve enjoyed being a much more active member in our community. I am one of the founding members of the DCLBabydolls. I was a judge for the Parcel Metaverse Fashion Show during Fashion week. I was interviewed and had my words featured in Davos, Switzerland by Female Quotient. I’m a Decentral Games Ice Poker Crown & scepter holder (Crown #13) I host the Decentraland Community Building Twitter space every week with my co-host SinfulMeatSticks, and I’m one of the founding members of the Discord server “Community Building Decentraland”. I own 13 parcels of land, and as of this writing, every single piece is being built on for free by other people.",
    "motivation": "My love for Decentraland is very personal to me. I bought my land before we could walk in this world, which was a phenomenal risk we all took back then. I’ve watched this place grow during a bear market and grow during a bull market. Because I was here before launch and only became more involved recently, I feel like I have one foot in the world of original land owners, and one foot here with the new wave of users coming in. I hope that I can represent the interests of both new and old parties in an equitable way. I already vote with over 26K of my own VP in the DAO, and I am here for the long haul. I will fight fiercely to make sure Decentraland grows in a way that is sustainable for our future existence and future land value. As a woman, I also want to make sure that we have a seat at the table as the world transitions to Web3. I will ensure that the Decentraland that we build will remain a safe and inclusive place for ALL individuals.",
    "vision": "In 5 years I want to see Decentraland serving as the longest-running and most ADAPTABLE Metaverse on the blockchain. We don’t have to have the best graphics or serve the most people, but we do need to commit to constantly growing and changing. I believe Decentraland will never be done growing. When I look at how much DCL has changed from the first day we could walk in it, I realize that the future we are building is going to be something we cannot even visualize today. I want to see experiences added to Decentraland that are not simply here to entertain, but to force us to examine closely our own human experience. And ultimately, I want our contributions here in Decentraland to somehow make our own world a better place, because otherwise, what is the point? The role of the DAO is to help guide us in a decentralized way that we all can have a part of, from a holder with 1 vp to a holder with a million vp. The DAO is the very thread that holds us together and makes us different than corporatized worlds that are going to become extremely competitive very soon. But mostly, I want to build the future we have not even imagined yet.",
    "most_important_issue": "Onboarding new users & Retaining the integrity of our land contracts. I think the biggest challenge is bringing in and retaining new users into our ecosystem. Decentraland has steep competition from burgeoning blockchain metaverses but also the corporate metaverses already established like Fortnite and Roblox. I believe that we should not assume that our future is certain. We DO NOT want to become the MySpace of the Metaverse! I believe it is up to every one of us to work towards creating a world that people want to explore and return to. The DAO can assist with this by funding grants that allow creators to build new and innovative experiences that people will want play and invest in. It is also the responsibility of the DAO to operate in a fiscally responsible manner, to ensure that there are funds to access in 5 years from now. As a land owner of 13 parcels, I am always going to vote in favor of protecting the integrity of our land. Decentraland was founded on 90,000 plots of land, with specific limitations put into place to ensure that these parcels would remain a scarce commodity in perpetuity. I believe we cannot compromise on this. However, we can get creative on how to help others access land, from developing frictionless rental contracts to building a revolving schedule to allow creators to have access to land, the latter I am already doing on my own. As more users enter our ecosystem there will continue to be a push for releasing more land into the pool to utilize…from lost, unused land to dissolving pre-established districts. But we do not need to compromise the basic foundation that Decentraland was built on to get land into the hands of the people who want to build on it. We just need to be creative and brave in how we find other solutions."
  },
  {
    "address": "0x9dab43bc15bd29cfe3030ca1b7edb3eeb9f3b6c1",
    "bio": "My Name is Sinful I am one of Decentralands Twitch streamers. I have been in the space for 8 months. I am a show host , content creator, Twitter Space host with Canessa. I am a believer of this ecosystem and I am here for the long run.",
    "links": [
      "https://twitter.com/Sinfulmeatstick",
      "https://www.youtube.com/c/SinfulMeatStick",
      "https://events.decentraland.org/event/?id=ddcf355b-6fd6-41b5-9f0c-46a3d7f824a5",
      "https://www.twitch.tv/sinfulmeatsticks"
    ],
    "relevant_skills": [
      "Community Builder",
      "Content Creator",
      "I facilitate the onboarding of new users to DCL as well as mold the new user experience",
      "Show host",
      "Event Organizer"
    ],
    "involvement": "I am one of Decentralands most active Twitch streamers, I have a following of 2.7k on Twitch and 1.2k on YouTube. I use my Twitch platform to welcome, help, and onboard new members into our community. I Host a weekly show called “Beyond The NFT” which has been going strong for 19 weeks straight, where I have interviewed some of Decentralands most iconic figures : Roustan, Aaron Leupp, Tangpoko, Micheal K, DoctorDrip and the list goes on! I host weekly Decentraland Community Building Twitter Spaces with Canessa, and I am Founder of the Community Building Decentraland (CBD) Discord server where our Decentraland community members are actively engaging with one another in efforts to build a brighter Decentraland. I am active on web3 Twitter Spaces always inviting artist, singers, and creators to join us and explore the possibilities this space has to offer. I actively Engage in the DAO, always placing my vote on what I feel is best for Decentrland. I also organize and host events for community members that lack the resources.",
    "motivation": "I want to be a guardian to our community , My goal is to preserve the integrity of Decentraland by supporting projects whose team members have invested their time and efforts to our community. I strive to protect the investments made into this ecosystem by both old and new users, and want to do my part to ensure we have a vibrant ecosystem where everybody’s voice is heard. I will contribute in making sure DAO Funds are used for the good of Decentraland and do my part to preserve the integrity of our DAO , So that the DAO may continue to help Community projects build for years to come. Through my DAO votes I hope to contribute toward the Decentraland our community members want to be in.",
    "vision": "I may be a dreamer when it comes to my 5 year vision for Decentrland, In 5 years I see Decentrland having all the tools and resources needed to allow users to jump into Decentraland and be able to find the knowledge they are looking for. I envision an inclusive space welcoming to everyone and anyone I see a big strong vibrant community where everyone’s voice and opinions matter. Esteban Ordano Co-Founder of Decentraland about 3 weeks to a month back joined The Decentraland Community Building Twitter Space Canessa and I host and made a comment that really stuck with me about handling toxicity in Decentraland 'It’s so lovely to hear that the community self heals in a way, It blew my mind that someone was trolling, and everybody started to say “good Morning” instead of engaging with the troll and being toxic' This comment really resonated with me because his words have me a glimpse of his vision of having a strong and loving community. It was nice to see that my visions aligns with one of Decentralands founders vision.Another quote by Esteban that really caught my attention was 'it’s not the foundations job to dictate how the world is ran, it’s the community’s job to tell them what type of world they want dcl to be'. I was vary moved by these words because he is right! It is our job as the community to bring to life the world we want to see and it is our actions today that will dictate the world we see tomorrow.",
    "most_important_issue": "I think the most important issue Decentraland faces is the lack of Docs/videos, and resources to help make the onboarding process for new users smooth and painless . Furthermore the resources need to be readily available and easy to access. I strongly Believe content in every language is a necessary step for Decentraland to be able to truly call its self a global Metaverse , of course my personal belief is that this should be a community lead effort and the DAO should be used only as support."
  },
  {
    "address": "0x86EDB92e217605DbeCF606548e48dAaf1B817DA1",
    "bio": "Founder of LifeOfMusk NFT and MetaTrekkers NFT, Texas Blockchain Council ambassador and Decentraland reporter",
    "links": [
      "https://discord.com/invite/EYF3sNp3WN",
      "https://metatrekkers.io/",
      "https://twitter.com/MetaTrekkers",
      "https://www.instagram.com/metatrekkers/",
      "https://opensea.io/MetaTrekkers",
      "https://www.youtube.com/channel/UC-SYkHA2oprg8k2IPIkuJLg",
      "https://www.facebook.com/Metatrekkers-NFT-100162365989691"
    ],
    "relevant_skills": [
      "web3",
      "web development",
      "3D modeling & design",
      "advertising & marketing",
      "art direction",
      "content development"
    ],
    "involvement": "Present as an early adopter through various investments for almost two years, I’ve owned land for a year and transformed it into a successful PoI story. Since then, our project has attracted and onboarded countless metaverse enthusiasts, and has always advocated for both the educational and investment aspects of Decentraland. Our direct involvement with the community can be seen through a year of constantly organizing events, parties, webinars, courses, and art exhibitions.",
    "motivation": "One of MetaTrekkers’ main purposes is to make Decentraland a widespread social interaction environment that at the same time provides viable revenue, job, education, and investment solutions to all users, equally.",
    "vision": "I want to see visionary projects being developed, the kind that erases the boundaries between the metaverse and the real world, making it a seamless experience for the user, where they get to enjoy the best of what both worlds have to offer. And I think this future is possible only through the expansion of DAOs into more aspects of life.",
    "most_important_issue": "In order to evolve, Decentraland needs to bring in a constant stream of new users and provide them with unique monetization solutions. It won’t be easy, especially due to the prolonged crypto crisis. Still, in order to become a truly open-source, constantly developing DAO, Decentraland has to overcome an important challenge: move from a trendy, hot topic, to a self-sustaining, stable, organic growth environment driven solely by its users, with equal voting and decision powers."
  },
  {
    "address": "0x9937E3e274be96a624d7Cd00F384EB71c741Dd1b",
    "bio": "Hi! My name is Maryana, a DCL citizen since 12/2021. I am a Twitch streamer, content creator, and a Decentraland Reporter. I co-founded metaverse networking & consulting company, BVERSE. I am also the CMO for The Ocean Meta NFT project.",
    "links": [
      "https://www.twitch.tv/maryanadcl",
      "https://twitter.com/maryanaDCL",
      "https://www.instagram.com/maryanadcl/",
      "https://www.bverseconsulting.io/",
      "https://www.theoceanmeta.com/",
      "https://www.thedecentralandreport.com/",
      "https://www.youtube.com/watch?v=3MQEB6MeQE4"
    ],
    "relevant_skills": [
      "Project Management (BVERSE)",
      "Event Coordinator",
      "Streaming/Hosting (via Twitch/Twitter Spaces and Clubhouse, and DCL events)",
      "Content Creator (Photography and Video Editing)",
      "Instagram reels & posts",
      "Twitter posts",
      "Twitch content",
      "Linkedin engagement for Metaverse related content",
      "Decentraland Reporter",
      "Wearable Creator (4 wearables on market)",
      "Community Manager",
      "admin for Decentraland Community Building"
    ],
    "involvement": "I have been in Decentraland for 6 months now (I first entered on 12/23/2021). Since then, I have been able to achieve the following: Led & Moderated early discord servers such as the Rich Homie Gang. I continue to lead BVERSE, the Ocean Meta, and engage in the Decentraland Report. - Co-hosted a few events in the community (i.e., Community Metaverse Fashion Week with MetaParty & Nikki Fuego’s Vroom Vroom Grand Prix). -Speaker for two Ukrainian Fundraisers for MetaParty & Dogman to raise funds for Ukraine via wearable sales. -Streamed Decentraland content on Twitch. -Decentraland Reporter (May 2022) & interview members of the Community. -Co-founded BVERSE, a metaverse consulting company & networking to onboard businesses and build a business professional community. -Host Twitter Spaces, collaborate with business & NFT projects, moderate Discord. -Launched 4 wearables on marketplace (2 dresses, 1 diamond heel, sunflower aura). -Event planner for events (i.e., Maryana wearable launch party, Community Drone Gallery, Ocean Meta NFT Launch party, Twitter Spaces). -Entered video into DCL Film Club. -Learn SDK (still learning), courtesy of Last Slice. -Engage& vote in DAO proposals. -Network with various companies, NFT projects, individuals on Clubhouse, Twitter Spaces, Linkedin, Discord, and in real life. -I have been supporting users by purchasing wearables, attending events, and promoting proposals, games, wearables and events. -Active in the community, create engaging posts on Twitter and Instagram",
    "motivation": "Currently, I hold about 300 VP (name claims, mana in wallet), and would like to have more female representation in the Decentraland DAO, given my continuous support and presence in the Decentraland community. Unfortunately, I do not own land currently. I have been one of the few active females in the community, wanting to bring value and growth into Decentraland. I have been volunteering my time outside of my job to create content, reach out & build meaning relationships outside of Decentraland of potential projects/businesses to enter DCL. I want to help contribute to proposals being passed, should they have the right “potential” needed for Decentraland to succeed. Also, coming from a finance background, I believe I possess the skills to properly assess projects, its budgets, in an independent, unbiased way. I have 4 years of external/internal auditing skills that allow me to question the controls in place and credibility of a user/entity. I want to help ensure that proposals are sufficiently documented, or that each project is represented fairly, and are detailed with budgets. I want to make sure due diligence & research is done on each proposal prior to voting, and ensuring our DCL stakeholders (i.e., landowners) are being properly represented in their investment. In terms of the DAO, I want to ensure point of interests are being properly approved, proposals are enacted sufficiently, funds are used correctly, and updates are sufficiently provided. I also want to make sure the right mix of proposals are being created (i.e., budgeting the “kinds” of grants that get passed quarterly).",
    "vision": "I see Decentraland being a leader in the Metaverse of showing what is possible to achieve as a creator in Web 3/blockchain. I want to show that diversity and female representation is achievable in the platform. Ultimately, my 5-year vision is to see brands enter Decentraland and want to stick around due to the QUALITY of the community members, not quantity. (Currently, we are facing a user retainment issue at the time of posting, making it harder to find more quality new users. I also want to see more of Decentraland’s land being developed with different experiences. I want Decentraland to be known as a metaverse where there are education parcels (i.e., universities, self-learning), gaming, galleries, retail, office space and more exist and is possible to achieve in a co-existed space. I want to see Decentraland content being on all “broadcasting screens” of the web (TikTok, Pinterest, Reels, Linkedin, Reddit, WSJ). I want to see a community genuinely wanting to help in advertising and onboarding users into Decentraland. I want to see more events that represent global representation of all people of different ethnicities. I also want to see more transparency and tools created for the marketplace, better land stats for businesses to utilize in their KPIs and assessment of engagement in Decentraland.",
    "most_important_issue": " believe retaining users and providing resources for new users is one of the most important issues. Retaining businesses in Decentraland is very much so important as well, since these brands are out there “vouching” for the metaverse experience. Another issue we currently face is the lack of marketing and education to the masses of the internet about what Decentraland is, and what the benefits are to join this platform. More content needs to be on social media platforms like TikTok, IG, YouTube, Linkedin, Reddit, Pinterest, etc. There should be more consideration in incentivizing reasonable creator grants/affiliates and believe that there needs to also be more experiences created for all users and backgrounds, religions, sexual orientations, and hobbies/interests of all types of people. Currently, there is not enough experiences or content within the algorithms of the internet to market Decentraland. There is also a high barrier to enter (i.e., computer software, types of mediums DCL currently is on (currently only browser and client at the time of writing). I believe the infrastructure of DCL also needs to be enhanced (servers, loading times, scene radius/loads, as well as the consideration of DAO VP for active users/creators, not just landowners. Additionally, a social platform should be considered within the platform, so users do not have to always communicate outside in Decentraland."
  },
  {
    "address": "0xAEe59932F7f293DB8d56F5B60Be7713BCA27E7d7",
    "bio": "As a serial entrepreneur, Gonzo got his start at Rutgers School of Business. While pursuing a dream in Medicinal Marijuana and founding his own Holistic Hemp company, Gonzo helped many people free of charge. Gonzo worked to help build a Criminal Defense law firm in Denver Colorado. As an avid gamer and digital designer, Gonzo opened his own Web Design & Video Marketing Firm in 2020. As a proficient computer wizard, Gonzo is helping others to lead the way in the development of Web3 business, as well as the expansion of the virtual frontier. As of 2022 Gonzo is currently working with some of the best design studios in the world on multiple projects that include 3D Animation, Large scale NFT Creation, and Game Asset Design.",
    "links": [
      "https://www.gonzocreations.com/",
      "https://www.instagram.com/gonzodigitalcreations/",
      "https://twitter.com/gonzo_graphics"
    ],
    "relevant_skills": ["Web design 2.0/3.0", "3D Modeling", "Video & Efffects"],
    "involvement": "Ive been involved in DCL for a year. Love the community. Part of slices of the metaverse. They help a lot of people get started. Took part in the christmas event in 2021 as well as the 837x event from samsung. I was lucky enough to get a pair of shoes, and it got me thinking.",
    "motivation": "I want to give back and help the community grow. As i can afford land and dont have much money. This seems like the best option. I would love to see more engagements. Help to add to the community and help people, not troll them. Id like to build a place where other like minded people can gather , shop, whatever. Im interested to see how the 3d design changes in the future.",
    "vision": "Id like to see DCL become the go to metaverse for first timers and people interested in the metaverse. Not corporations but people figuring stuff out for themselves, without being censored. I love the fact that someone can build whatever they are capable of designing. WE plan on making some cool shit.",
    "most_important_issue": "probably barriers to entry. DCL needs to be more user friendly for creators as well as not so savy tech people. The Average joe."
  },
  {
    "address": "0x4262f8BB5bd9Ad132782D2a7279b532A1DC6BCbF",
    "bio": "Founder of the Wilderness P2E game & DAO Optimist",
    "links": ["https://twitter.com/palryan"],
    "relevant_skills": ["Web 3", "Game Development", "Entrepreneurship", "Team Building", "Project Management"],
    "involvement": "Joined in Dec 2021 and applied for a small (3k$) grant to build a game. - Launched Wilderness P2E within a month and have been growing the Wilderness P2E and Decentraland Community ever since.",
    "motivation": "Support Promising New Projects : Having started my journey with a grant from the DAO, I would like to give back by utilising my ability to identify potentially long term successful projects.- Support Developers in DCL : Developing in DCL for over half a year has put me in the right spot to be able to understand the processes and the technical requirements of different systems of decentraland.",
    "vision": "The incubation hub for 3D experiences. I would imagine several giant startups to emerge out of building new 3D experiences for billions of people in this next era of internet.",
    "most_important_issue": "New User Onboarding - Attracting and Supporting Talented Developers - Not enough participation by the community when it comes to decision making or contributing solutions to the platform."
  },
  {
    "address": "0x56469159D91eb810dCE34dd13eC4eD8194bCA7be",
    "bio": "I am Nikki Fuego! I am a Drag Queen, Wearable Creator, Content Creator, and Game Creator. I have called DCL my home since November of 2021. Top-Seller for Metaverse Fashion Week 2022.",
    "links": ["https://twitter.com/NikkiFuego92", "https://twitter.com/Vroomwayio", "https://www.vroomway.io/"],
    "relevant_skills": [
      "3D Modeling",
      "Wearables",
      "3D Environment",
      "Beginner DCL Programming",
      "Graphic Design",
      "Community Engagement",
      "Video Production",
      "Branding",
      "Entertainer/Performer",
      "Customer Support Management",
      "Product Development",
      "Ecommerce",
      "Franchise Management Musician",
      "Project Management",
      "eCommerce & eCommerce Automation",
      "Telecommunications",
      "Recruiting/Retention",
      "Marketing and Advertisement"
    ],
    "involvement": "I’ve been involved since late November 2021. There hasn’t been a day go by that I haven’t been involved with the community since then. I made my first wearable in December 2021. In January 2022 I made 56 wearables and February 2022 I made 48 wearables. I released 4 Fashion Week exclusive collections and sold out of all 4 collections. I created the first car wearable in Decentraland called VroomVroom and have created an entire brand around it aside from my Drag brand. I held an in-game event centered around the VroomVrooms that featured racing elements in those wearables. We gave away three 1:1 Unique helmet wearables to those winners. That community movement created Vroomway. We applied for a tier 4 grant and were approved with just over 2M VP and 160+ Yes votes. Our goal is to introduce more fun ways to utilize wearables while also introducing more dynamic vehicle experiences. I help people learn blender and troubleshoot with people 1:1 in the community to help them get better with their 3D modeling. I’m all about less competition and more collaboration. I’m involved with many Twitter Spaces and Discord Communities to help push the community forward. I am constantly looking at proposals in the DAO and helping advocate for inclusion, representation, transparency, and trust. I’m not afraid to speak my mind when it comes to things that I disagree with especially when it impacts a community I care so much about and call home.",
    "motivation": "I think it’s really important for the community to feel like it has balanced control over how the platform will develop. Representation of that control is super important too. As a Trans person, representation is everything. The community I’ve been a part of and built around my wearables is something I have never experienced before in my life. I have felt so accepted and loved in every aspect (aside from the common trolls) of the community. My life has drastically changed. Since joining DCL, I have been able to make dreams a reality. It really has impacted me for the good. I am happy with where my life is right now. Even with challenges, I feel supported for the first time ever. I’ve been working a full-time job running a customer support department for a start-up for almost 2 years now and also balancing this while creating this journey within Decentraland. Because of how impactful Decentraland has been on my life, I feel the desire to protect and fight for it! If I could help replicate this experience I’ve had for even just one person, I would feel eternally fulfilled. That only happens with representations in these issues. About a month ago I was a very vocal speaker on the wearable submission fee and I truly feel like I spoke for a community of non-typical creators. Speaking up for those creators who feel powerless and speaking up for the newbies who feel overlooked. To be heard by the foundation and DAO really spoke volumes too. They took the communities thoughts into consideration regardless of VP, but I know that is not always the case. Decisions focused on changing the platform for the good, should not fall to the wallets of a few, but rather the community and those willing to stand for it. I’m grateful to even be considered for it. I wanna see the DAO become more integrated with the community itself. As it stands, we are in a constant education battle with the common player. The second they hear VP as a barricade, they are detached and uninterested. I believe as a community we can change that and make it practical for all citizens of any capacity. Isn’t that what web3 is all about? Creating a future worth being excited about :D!",
    "vision": "In the next 5 years, I see Decentraland being the leading social space but without all the KYC data harvesting. I see Decentraland being a leading metaverse as it is now. Just seeing how the platform has changed in the short 8 months I’ve been here, the platform has a shining future ahead of it. I see us leading the way in what an immersive and dynamic metaverse can be. We already achieved that with Fashion Week this year. The fact that Meta acknowledged our efforts as a community spoke volumes to me. I see the micro-communities within Decentraland coming together and really collaborating to engineer progression that replicates all the things we love about the platform to new people. I see us changing lives and bringing true freedom to people that have never experienced that before. I truly believe that we will be THE platform for creatives and gamers. We have a lot of passionate developers and game creators that we can easily fill all 90,000 parcels with never before seen experiences! Brick by brick!",
    "most_important_issue": "Security and education surrounding that security. As someone who is fairly new to the crypto and web3 space, there is a monolith of information to learn. To me we are in a similar spot to when credit/debit cards merged with the internet. When people were first using their credit cards online, they were being hacked left and right. I remember my Grandpa would always get mad when me and my cousin would want to buy a computer game because of the few times he was hacked doing so. I have been victim to two hacks now during my 8 months. In the first hack, I lost $900+ and in the second hack, I temporarily lost 2 names. I know my experiences are minimal in comparison, but to the average person who doesn’t have the same determination to keep moving, this has caused hundreds of people to leave the web3 space entirely without even having a chance to experience the things that are worth staying for. I believe this can be tackled with education first, then protocols proceeding. We need to rally as an entire community and build up our confidence to spot these hacks before anything is lost. The majority of the people entering the industry in the last two quarters are not those of web3 background or programming background. Because of that, education is a requirement in order for Decentraland to grow and be appealing to the masses. There are solutions, we just have to come together and find them! I think once we have more games, more in-world experiences, and more security we can really appease the masses and onboard more and more players! This platform is big enough for mainstream media and we are only a stone’s throw away! Anyway that I can help bring repeat and new attention to DCL, I will! My Vroomway project aims to provide a safe place for every player and play style for people, new and repeating, to experience! Brick by brick there isn’t anything we as a community can’t do! :smiley:"
  },
  {
    "address": "0xfBA23Bb6d4BC1c23d3a53d6b5B19d84d4e4b50b6",
    "bio": "Hello, my name is Mr. J. My real name is Joel and I am co-founder of WJ Designs. My 1st degree was in Graphic Design. Then I spent 6 years in the Marine Corps where I separated as a Sergeant QA Inspector for the F/A-18 Fighter Jet platform Aviation Electronics. Present, graduated as an Electrical Engineer this year. I use my unique set of skills with coding, robotics, software, animation, and art to create for the Metaverse in every medium I can get my hands on…",
    "links": ["https://twitter.com/mr_j_1987", "https://wjnftdesigns.myportfolio.com/"],
    "relevant_skills": [
      "2d graphic design (all mediums)",
      "3D fabrication and design",
      "CG scene fabrication",
      "logo/advertisement design",
      "2D and 3D animation",
      "sound editing",
      "video editing",
      "coding in various widely used languages",
      "electrical technician",
      "team supervisor",
      "Fortune500 Investor",
      "project manager",
      "community organization",
      "indoctrination",
      "financial asset allocation",
      "avid Metaverse user."
    ],
    "involvement": "I work with Mr.W within WJ Designs. We established our brand 3rd quarter of 2021. Since that time we have been working diligently collaborating with various streamers, community, members, and project managers within Decentraland collaborating to supply custom graphical representations of art or assets in 2D and 3D for elevated user experiences that cannot be procured through “ready made” meshes. We help organize events within the community and collaborate with various Land owners in Decentraland to aid in event promotion, curation, and organization. All while doing our best to stay as helpful and respectful as possible.",
    "motivation": "I always try to observe and keep my head down. Put one foot in front oft he other and try not to ruffle any feathers. But now that I’ve been within the community for so long and have been as involved as I have, I feel it would be irresponsible of me to not apply for delegate right now. I want to be able to have a voice in Decentraland so that I/we may make unbiased and fair change governed by rationality. I want to see us create a fair governance that places power into the hands of capable individuals that have true intentions for the space. And this forum itself is an example of those changes. Morality and technicality need to be taken into account equally. As I want to see the space integrate more efficient low-latency servers and user-friendly integration to the UI, users still need guidance. I want to see the space evolve and and grow. I want to be a part of that change.",
    "vision": "I want to see a Decentraland teeming with creativity backed by a game engine and server-base that opens endless possibilities. A space that has solidified and established itself within the financial and social rungs which identifies us as the only place you’d want to go for art, creation, and social events. I am aware the competition is vast, but I can’t see another Verse replacing what Decentraland has to offer. And I feel that the DAO will be the vehicle to drive those innovations and improvements. The work gets done in the DAO.",
    "most_important_issue": "I feel that security is the biggest concern right now in connection with visibility. We need to attract new users and showcase the capabilities of the space. However, when a new user is confronted by a security risk within the Metaverse, they are very quick to give up all together. So I feel that attracting new users and giving them a safer space to explore is very important right now. Some of the largest challenges that we will all be facing in the next 12-24 months will be attracting users to the space and retaining those users. As we traverse through this crypto winter, we need to be ready for the market recovery. New metaverse are getting ready to release all year and we’ll need to do our best to act quickly and concisely within the DAO to deliver a Metaverse that can solidify itself within the ranks. Making it clear to the rest that Decentraland is here to stay."
  },
  {
    "address": "0x0817a129b4794B25C291fC03429d5c2535921eCc",
    "bio": "I am commonly known as MisterW or in Twitch as MrW1981. I have been in Decentraland since Q3 of 2021. I am a co-operator and co-creator for WJ Designs, where I work in collaboration with Mr. J. Together, we have worked on several projects for influencers in Decentraland, including many streamers, ICE poker players, and community members. I am a recent graduate in Electrical Engineering with a concentration in Computer Engineering. I have more than 5 years’ experience as a graphics designer in both 2D and 3D mediums. I am currently an Automation Developer and have been playing around within the Decentraland SDK.",
    "links": ["https://twitter.com/MrW_1981", "https://wjnftdesigns.myportfolio.com/"],
    "relevant_skills": [
      "( 2D mixed-medium artist)",
      "(3D modeler",
      "mentor",
      "videographer",
      "DCL wearable creator",
      "(programmer in C++",
      "JAVA",
      "MATLAB)",
      "RPA automation developer",
      "Polygon NFT project creator",
      "Decentraland events collaborator",
      "production manager",
      "active community member."
    ],
    "involvement": " I have been in Decentraland since November 2021, I started working on 3D wearable designs in December 2021. I have partnered with Mr. J, who is the co-founder and co-creator to WJ Designs. We have worked on many community wearable projects and have provided content creation for several Decentraland events. We have helped mentor other 3D wearable creators in this space to aide them in their custom creations. We have started a recognizable brand within the community that showcases our attention to detail and high-quality designs.",
    "motivation": "While within the space of Decentraland, we have become a staple (well known) in the community. We have supported several projects throughout Decentraland both with content and community awareness. As we continue to support members of our community, we feel it has been a slow growth to obtain enough VP to make a notable difference. With the delegation, I feel it will provide enough VP to feel like my voice can be heard and account for something more than just an opinion. Since delegation is a huge commitment to the DOA and our community, I would ask that this selection of candidates be done so with the highest regard for its impact.",
    "vision": "In the next 5 years, my hope is that the community continues to grow substantially enough to organically bring more newcomers to this space. Decentraland has become more to us than just a digital space, we feel honored to be a part of something outside of our normal day-to-day and to share the love of concept and design with others. I feel the future of the DOA will help to provide a necessary governance driven by the community and keep this space free-and-clear of central-controlling bodies that dictate specific self-driven interests.",
    "most_important_issue": "Currently, there are constant security threats to holders and creators of NFT assets. I know of several cases where community members have had their names stolen, have had their crypto currencies depleted, and have received fake assets. One of the challenges will be to create a safer space and to educate new members on the risks involved in this seemingly harmless environment. I believe if we can tackle the security issues, our community member retention will also increase due to the lessening of negative experiences."
  },
  {
    "address": "0xB5F4ebcC5a90e58D953eE9e64e365C2468f31F51",
    "bio": "Hey there! I’m GoldGuy, and I’ve been a part of the DCL community since November 2021. When I’m not busy running the G.G. fashion brand, The Gold Guy (specializing in highly detailed high-end fashion), I like to dabble in other creative outlets – like digital NFTs! I’ve successfully deployed over 30 pieces of digital wearables into DCL since December alone, and it’s been a blast! My goal is to continue pushing the envelope with my fashion brand – and who knows, maybe one day we’ll be able to walk the runway at Fashion Week in IRL and represent DCL.",
    "links": ["https://twitter.com/GoldGuyDCL", "https://twitter.com/BVerseDCL"],
    "relevant_skills": [
      "Finance",
      "Banking",
      "Branding",
      "Marketing",
      "Networking",
      "SEO",
      "Graphic Design",
      "Website Design",
      "Communication",
      "Excel"
    ],
    "involvement": "Co-founded BVERSE, a metaverse consulting company & networking to onboard businesses and build a professional business community. Cohost of weekly bonfire Twitter spaces. Helping brands create their presence within DCL and teaching them how to grow and move within DCL. Highly active voting on DOA grant proposals. Highly active in the creator community, bring new ideas into DCL",
    "motivation": "I have become a big fan of Decentraland! I got involved around Nov 2021 and have been hooked since investing my time, offering my IRL resources to others, and helping them grow their brand and voice in the DCL metaverse. I love how the community and platform enable people to create and share their experiences. ",
    "vision": "I’m a big thinker. In the future, I see Decentraland as a place where people can come to experience anything and everything they could imagine. It will be a world of creativity and innovation, where people can come together to share their ideas and experiences. If we as a community can work together now and vote on the right projects to help expand for long-term growth, we can help DCL sustain the top spot in all upcoming metaverse.",
    "most_important_issue": "Since November, I’ve been involved in the Decentraland community, and I think improving user experience is the most important topic. As someone who’s always looking to help out, I want to see Decentraland grow into something extraordinary, and I like to continue to help make that happen."
  },
  {
    "address": "0x509CDeBBa232E7B7f603db5C93D1e4f1FeD9c6F8",
    "bio": "Hello my name is DrGreenthumb or green. Been in crypto sence 2017 and bought mana in 2018. Refinish hardwood floors for 22 years. Now full time dcl web3 for about 1.5 years. Most would say i didnt sleep in 2021 as you could always find me in world.",
    "links": ["https://twitter.com/greenthumb1435"],
    "relevant_skills": ["builder", "sdk", "event host", "discord mod", "co founder of apes 3d."],
    "involvement": "Member sence early 2021,Last slice collective. Meet some great people and started building and growing from there. From learning to build to promoting and running weekly events. land owner,wearable creator.",
    "motivation": "Active voter within the dao with not enough vp to make much of a diffrence it feels like. We need more support for the creators,who are keeping dcl alive. whales come and vote for themselfs but never really vote on anything else. Grants are becoming a concern with the high amounts some ask for,with little to no effort done. This helps the little guys like me (with low vp). Active in world and the community to make the right choice within the dao.",
    "vision": "Decentraland is here to stay. The community has some of the most amazing people ive meet in my life. With so many metaverses out or being built. I would love to see dcl always on the top leading the way. There is alot of work to be done, and i will for sure be building these next 5 years and beyond.",
    "most_important_issue": "Keeping up the DAU count. Some advertising by the foundation wouldnt hurt either."
  },
  {
    "address": "0x56D947fA1AE6d6293b307b489540C156AF628F0F",
    "bio": "Howdy! I’m DOCTORdripp and I’ve been in DCL since October 2021. I started creating wearables shortly after joining and I’ve been married to DCL ever since. I’ve launched 18 wearables and have 14 pre-ordered. When I’m not making wearables or learning SDK, I’m building websites and show cars. My favorite part about DCL is connecting with other artists on many different levels & in ways that constantly push my own art to new heights.",
    "links": ["https://www.twitter.com/DOCTORdrippNFT"],
    "relevant_skills": [
      "Crypto, NFTs & P2E",
      "Wearables & 3D Modeling",
      "Website Design & Development",
      "E-Commerce & Product Photography",
      "SEO & Online Marketing",
      "Graphic Design & 3D/2D Print",
      "Video Production & Editing",
      "Sound Design & Music Production",
      "Data Scraping & Automation",
      "Skateboarding & Modifying Cars",
      "200m RuneScape Mining XP"
    ],
    "involvement": "Extremely active member of the DCL community both in-game and major Socials. Community Manager for Vroomway P2E Game. Wearable Creator for Voxboards P2E Game. Attended multiple SoCal meetups, networked w/ Roustan, Lastraum, Gigi & more. Quietly building & learning every day",
    "motivation": "I believe in leading by example and I’m ready to make a bigger impact within our DAO. While I want to say that I will mostly vote yes for things that benefit our community, I think there is a shadow that must be addressed too. I think that as our user-base surges again, we will see more bad actors trying to take advantage of grants. I want to be able to downvote any grants that are not beneficial to the growth of DCL.",
    "vision": "I’m here to spread my wings as an artist alongside other talented and established artists. My short term goals are: to make a mark in the current P2E offerings through my contributions to the dev teams that I’m currently participating in, and to complete Transformative Streetwear Volumes 2 & 3, which are already pre-ordered. My long term goals are: to cement the DOCTORdripp brand as a digital heavyweight in the streetwear and digital fashion planes, and to help & inspire as many people as virtually possible.",
    "most_important_issue": "Bad actors who vote for their own grants must be stopped. Docs need updating. Talented content creators should be funded - DCL needs more marketing material. & wen hand category? (jk but not rly tho) It’s time for our core community, not just the whales, to have a strong voice about what changes should be brought to DCL. I’m ready to use mine and I’d be honored if anyone who is simply not using their VP would delegate any amount to my wallet.         DOCTORdripp.dcl.eth. DOCTORdrip.dcl.eth. dripp.dcl.eth. Streetwear.dcl.eth. Skatewear.dcl.eth. OhWhale.dcl.eth"
  },
  {
    "address": "0xBD03aDd5da0e173C67C9C1073FFBA017147c42d4",
    "bio": "Most people know me as Vapo, but I also manage the DCL Highlights account. I’ve been working fulltime on web3-related content since november 2021.",
    "links": ["https://twitter.com/0xVapo", "https://twitter.com/DclHighlights"],
    "relevant_skills": ["Content creation", "community building", "video editing", "marketing"],
    "involvement": "I’ve been involved with DCL since november 2021, published two wearables and helped build some communities within DCL (GamiMallMD, MetaDrip to name a few).",
    "motivation": "I want to have a bigger impact on my votes, to make a relevant difference on the DAO.",
    "vision": "I see Decentraland with improved graphics, full VR support and a way bigger community within 5 years. The DAO has a fundamental job to make it all happen.",
    "most_important_issue": "I believe one of the most important issues in Decentraland is the barrier entry to participate. You pretty much need a beefy hardware to play DCL with no stuttering, so I expect it to be optimized beside the windows client. I can’t wait to see the explosion of users when a good smartphone client gets released!"
  },
  {
    "address": "0xd5e9eF1CedAd0D135d543D286a2c190B16cBb89E",
    "bio": "Founder of NFT World, and OG within Decentraland since the beginning.",
    "links": ["https://nftworld.io/", "https://twitter.com/NFT_World", "http://nftworld.io/#0519"],
    "relevant_skills": [
      "Scene building",
      "wearables creation",
      "event hosting",
      "NFT project promotion",
      "land rentals"
    ],
    "involvement": "I’ve been involved with DCL since its inception. My company NFT World manages NFT World City - a 121 parcel scene hosted in the Aetheria District where we host events to promote products and services from our sponsors. We have created the first Attend-to-Earn (A2E) coin in the Metaverse aptly named Metaverse Coin (MTVRS) which is distributed to attendees of these events. MTVRS can be exchanged for avatar wearables on the MTVRS Market (https://market.mtvrs.com/). We also built Metaverse Chat (https://metaversechat.io/) and the Metaverse Browser Extension (Metaverse - Chrome Web Store)",
    "motivation": "I want to offer a larger voice to those in the community who share similar passions and ambitions for the future of Decentraland.",
    "vision": "Showcasing the utility of NFTs and the Metaverse at large. I see so much potential with this technology and the community for making Decentraland a go-to place for many different audiences from gamers, to artists and musicians, vloggers, shoppers, learners, investors, and so much more.",
    "most_important_issue": "The learning curve for building complex scenes. It takes a lot of skills including coding, 3D modeling, graphic design, and sometimes database administration, web hosting, and smart contracts in order to take full advantage of the Decentraland SDK. Even with all the required skills, it can still take a lot of time to build a complex scene."
  },
  {
    "address": "0x29519122d08771Ca4c83C8E3Fa981Df18721f76D",
    "bio": "Owner, founder & CEO of Decentraland’s first & biggest realtor “DCLRealEstate.org”. My background is “Finance & Economics” in the real world, where i am soon a Real Estate Agent. Been in Decentraland since october 2021, and kickstarted the land-rental business in DCL with my realtor agency.",
    "links": ["https://dclrealestate.org/", "https://twitter.com/DCL_RealEstate", "https://discord.gg/XBjCRTbRZP"],
    "relevant_skills": [
      "Selling lands for clients",
      "Buyer Advise in DCL",
      "Land rental",
      "DCL Land Market Expert",
      "Leadership & in general a trusted advisor for new users in Decentraland, who look to invest into land or rent it."
    ],
    "involvement": "I’ve been involved with DCL since october 2021. My company DCL Real Estate manages 10+ active rentals and properties, and we rent, sell and advise lands for clients. We have sold/rented over 30+ properties/lands in DCL since our foundation, and had 60+ video meetings and written over 1000+ discord messages with users who wanted to learn more about Decentraland and onboarded them into understanding the land market, Decentraland and in general Web3. We’re the leading DCL Expert in the land-market and have a active user-base of 900+ members in our land-focused discord where we love digital real estate. We contribute with helping people get started in the metaverse, as well with giving income to land owners with selling & leasing out their properties, aswell with giving new users buyer & rental advise.",
    "motivation": "First of all I love real estate - so im loving Decentraland, it’s community and the way it’s controlled. I LOVE Decentraland, but we need to improve it so we can keep being the BEST metaverse in the world in the crypto space, it’s the most important for me. DCL needs more positive changes and we need the DAO to stop being so careful and we need to accepting more projects and innovative ideas to improve = better game & more active daily users. Way too much land is empty, and i am ready to do my part as Decentraland’s leading realtor, investor and delegate candidate to make sure we create the best Decentraland as possible. I am ready to be your voice in Decentraland and work for the land-owners & new users best interest, and be your best voice possible. We need it to be easier for outside businesses and users to join us! We can do it, yes we can!",
    "vision": "First of all, no more lag & bugs. Fixing basic visual issues and allowing more projects and businesses to generate user activity to the land & content is our number one issue in DCL. I see so much potential with this technology and the community for making Decentraland the first choise of real life businesses and users to join us. We need to make it attractive and easy to access, as a “noob” in the web3 space, with fun games and NFT shops, cinemas and clubs, so business will thrive. In 5 years i see all big brands in the international world be a part of the metaverse with their own nft’s and shops. If we manage to make great partnerships we will be the number one choise.",
    "most_important_issue": "Scene creation, wearables and renting land needs to be EASIER. This is a MUST. We need to continue our development and be better at marketing."
  },
  {
    "address": "0xffd3C4424c2CBdB1776572C4D136F15be66890aF",
    "bio": "Wearable creator, Owner/Founder/Designer of KAZUTO (my wearable shoe brand in DCL), member of Year2Thousand design group, metaverse lover.",
    "links": ["https://twitter.com/Parzival_Kazuto", "https://twitter.com/KAZUTOkickz"],
    "relevant_skills": ["3D modeling", "wearable creation", "event production", "community builder/moderator"],
    "involvement": "I have been a part of Decentraland since September 2020 and have watched it develop to what it is today. I started creating wearables in March 2022. Also started helping organizing events for the community around Metaverse Fashion Week. Hosting events for my shoe releases as well.",
    "motivation": "Right now my main concern is the growth of Decentraland. I want to contribute to the DAO in ways that help the community and platform continually grow, and continue bringing new ways to further engage people and bring them into the Decentraland platform. I’ve been active in the DAO and also active with trying to teach my little community about the DAO.",
    "vision": "I see Decentraland being one of the main pillars in what we consider the metaverse in 5 years. The fully decentralized platform is groundbreaking, and I think it will be the ultimate success for Decentraland in the coming years. No other platform is going that route, which brings it’s own excitement for anyone wanting to be apart of the platform and add their own creativity or their own voice. This will be a platform you can come to and build whatever you can think of.",
    "most_important_issue": "I think the most important issue in Decentraland right now is growth and sustainability. As long as we can keep new things coming to the platform, that engages our community and draws new people in while the market is down will be key to the platform having an upper hand when the Metaverse hype comes back full force."
  },
  {
    "address": "0x52f8d5518a05366989B3BaAd9c8E1129cA317Fc7",
    "bio": "Im a crypto and metaverse enthusiast. I served in the United States Marine Corps as a Light Armored Recon Marine 03-11 03-13. I think this tech will & can change lives.It can prevent loss of life & change the world for the best.",
    "links": [
      "https://twitter.com/TheCryptoTengu",
      "https://discord.com/invite/jHBWv4t8Hz",
      "https://www.youtube.com/channel/UC5YNLgwCqBL0EGdHZmFy2qA"
    ],
    "relevant_skills": [
      "Active Listening",
      "Communications",
      "Moderation",
      "Engagement",
      "Education",
      "Analytics and Data Analysis",
      "Dedication"
    ],
    "involvement": "I have enjoyed running around exploring decentraland. Meeting other people and crypto enthusiast. I believe we are at the forefront of a new frontier. I have onboarded people in the past and hope to continue to do so.I have made a couple tutorials and event videos. Ive hired community creators to publish my own designs. Ive owned and built on land in the past. Im very eyes on and vocal in the dao. Im not a yes man or a paid shill. I try to learn and know who is who and what they have done. To look at the bigger picture and see different sides. DCL is not a profit scheme for me. My involvement is more as a user and engager then business or developer. I spent months running around wonderzone and the world before I linked a wallet and jumped full in. Think my profile will say Dec 7, '2021. Id say probably 4-6 months before that if not longer. I do remember watching news in 2017 or maybe 18 about the land sales and early days. However I just never had the economic ability at the time to land grab or jump full in. I was getting into coins and still learning. To this date ive given away a couple thousand wearables for free to try and draw in new faces and keep old. Ive documented events in this space on youtube and made tutorials. I remain active and try to walk in many communities.",
    "motivation": "To be honest I dont, but I think we need people who are watching and paying attention. We need people who are asking questions about why we need this. Do we need this and what does it do for Decentraland as a whole. I think the more diversified the dao and the vote power the more we have a thriving community. One that isnt a echo chamber or one sided. I think there is a lot of people who come here trying to get money and just run. Its kinda unethical and not at all beneficial to DCL as a whole. I want to see DCL thrive through development from the community and its ideas and the foundation itself. Its important to me that we dont gate keep. At the same time we cannot allow corruption, collusion and unaccountability stifle innovation and engagement.",
    "vision": "Id like to see Growth in user base, Experiences and engagment. Id like to see people use DAO funds for things that create immersive player experiences. This is what will separate us from the upcoming crypto gaming and metaverse boom. The build it and they will come approach. Id like to see us continue to develop and innovate. Add ability to trade wearables in game. Maybe even resources in built games. Ability to use emojis in chat. Id like to see us revisit smart wearables at some point. Maybe add player vehicles instead of just skins. Make it easier for people to build. Easier access or ability to stream or host music on parcel without the high learning curve. Larger parcel limits and size. Vr integration and connection to other metaverses through immersion. Thats probably further off tho.",
    "most_important_issue": "Lack of deployment on land. Lack of multi cultural content. Names in different language text. I think there are people who see people get money in the dao and not deliver and it discourages them from investing further into the platform. Also think people are noticing the same groups get funds and there is a lack of different people able to make something of them selves. They end up not wanting to be a part of the community. I think building on your land is intimidating to new users. Personally I think the current limitations are steep for a lot of people for what they pay. I think that also drives away very talented creators and individuals. I believe new players get overwhelmed and we need more not influencers but people educating and helping new comers out. In the months to come I believe other metaverses may pop up and follow suit with many of decentralands current issues. If they can however make building, streaming and content delivery easier they may draw more users. Some people will probably multi metaverse, but we could see a outflux of current user or new users we acquire. As of the time of writing this we are 8 to 9 months in a down trend. If we face another so called crypto winter we could see many people exit on that alone. I can also see if we do not support or enable current builders and content creators they may abandon this platform and take their skills else where."
  },
  {
    "address": "0x2684A202a374D87BB321A744482B89bf6DeaF8Bd",
    "bio": "Hey everyone, my name is Sean AKA FriskyBumbleBee, and I have been involved within Decentraland since 01/2022. I am 9-year army veteran, consultant, twitch streamer, Decentraland Reporter, and owner of Future Investment Group (FIG) LLC. I have been involved with numerous activities in Decentraland and collaborated with a individuals and organizations to create wearables.",
    "links": ["https://www.thedecentralandreport.com/", "https://futureinvestmentgroupfigllc.io/"],
    "relevant_skills": [
      "Project Management",
      "Consulting",
      "Leadership Experience",
      "Negotiations",
      "Streaming/Hosting (via Twitch/Twitter Spaces)",
      "Content Creator (Video Editing)",
      "Instagram reels & posts",
      "Twitter posts",
      "Twitch and TikTok content",
      "Decentraland Reporter",
      "Wearable Creator (10 wearables on market)"
    ],
    "involvement": "I have first entered this space in January 2022 and have been active within the community for over 7 months. I have been involved with many events, attended many shows, and have supporting different organizations as well as artists and creators within this space. The following are a few of the achievements and venues I supported: Attended the MetaParty Fashion Week as a content creator in March. Collaborated with individuals to publish wearables. Became a reporter for the “The Decentraland Report (May 2022) and have been actively engaged in covering content from events, to interviews with members of this space. Voted on previous DAO proposals. Create unique posts on social media (Twitter, Tiktok, and YouTube). Purchased many wearable creators by purchasing their wearables, promoting their giveaways / updates, and",
    "motivation": "I have about 2100 VP (1 Parcel, and name claim) in which I leverage to support new ideas and DAO proposals. However, I would like to have more because I can use my experience from the military and consulting to investigate the DAO proposals from a business perspective. Many subcontracts in the past I have worked with IRL, had proposed their deliverables in the scope of work. I also had many incidents where a scope of work was not clearly defined, in which resulted in a loss of financial and poor-quality deliverables. Leveraging my project management background as a consultant, I possess the abilities to properly assess a proposal by identifying crucial gaps and vulnerabilities, especially if the work breakdown structure is not clearly defined. My having VP delegated to myself, I can ensure the proposals are well documented, and provide an unbiased view from a business perspective and DCL stakeholders will be properly represented.",
    "vision": "I foresee Decentraland being the premier metaverse, and many of the builders within this space are ensuring this vision is being well achieved. It will scale further with even more active users. Although, many other competitors are trying to build new metaverses, Decentraland- will always be the premier hub in terms of metaverses. The number of builders and leaders within this community is unrivaled. I also would like to show military representation within this space. Many veterans, and even soldiers who are deployed to various parts of the globe, can still have connectivity, and have the social interaction that zoom, face time cannot achieve. My ultimate 5-year vision for Decentraland is having more large organizations and brands entering Decentraland, because of the quality community members, potential outreach to people across the whole globe, and leveraging the pioneers who have been supporting this space as subject matter experts. In doing so, members who have been in this space may bolster their career as a consultant or technical subject matter expert and work side by side with vast organizations. As for activity, in the past 6 months I have been in this space, I have seen pioneers such as MetaParty, DiceMasters, Babydolls and many other organizations really pushing the boundaries to provide a unique end user experience. I foresee many organizations within this space leveraging this skill set in providing amazing gaming, gallery, and event experience for individuals.",
    "most_important_issue": "One of the biggest issues I have seen during my tenure in Decentraland is retention and scaling the platform. Retention is quintessential because we need to have many quality users not logging on once and then leave, but to continue logging on and being part of the community. Much feedback I received from the community was “there was nothing to do.“ However, many organizations have down a spectacular job in creating a one-of-a-kind end user experience such as MetaParty with their battle 2 earn system, and DiceMasters with their incredible RPG developed, and BVERSE with their networking and fireside twitter spaces. I think as time progresses, there will be even more organizations creating new experiences for individuals to participate in. The last issue I have seen is up-scaling and marketing. Many organizations and even media outlets have attempted to cover topics on Decentraland and the metaverse in general, but fails to provide an extraordinary message to the possibilities within this space. Many social media platforms such as TikTok, LinkedIn, and reddit are untapped platforms that can provide amazing content in what Decentraland is, the benefits in this space, and ultimately exposure for Decentraland to upscale and attract quality users. Thank you for your time and consideration, and I hope I can be the spearhead in some of these changes with VP delegated to myself."
  },
  {
    "address": "0x447C9058bE5c164e0c4aae380381e7A5215052D4",
    "bio": "Hello, I’m Mr. Dhingia! I am a builder here in Decentraland since November 2021. Since then, I have designed 20+ custom builds for various projects and individuals. I have a club in Decentraland and have hosted various events. I also stay engaged in the community through supporting many events.",
    "links": ["https://twitter.com/MrDhingia", "http://www.mrdhingia.com/"],
    "relevant_skills": [
      "3D Modeling",
      "3D Design",
      "Video Editing",
      "Graphic Design",
      "Event Management",
      "Social Media",
      "Wearable Creator",
      "SDK (Basic)"
    ],
    "involvement": "I have been involved in Decentraland since November 2021. As stated above, I have worked with various individuals and projects in Decentraland to design custom builds. I have gifted a few of my builds to individuals who are contributing to the community. In my earlier DCL days, I helped many individuals with social media graphics, banners and videos, helping them launch and market their brands. I also help provide meaningful, ad-hoc feedback where I can and as I experience or come across many builds. For example, I have provided build feedback to users I come across at their parcel (i.e. collider issues, spawn locations, better use of materials/space). Additionally, I hosted multiple events at the Dhingia Club (144,-148) including an event for the Brazilian Community, and wearable launch parties. I have been actively engaging in the Decentraland community including attending events, providing wearables to the Decentraland Twitch Streamers for giveaways, attending Twitter Spaces, engaging in multiple Discord servers, and assisting with 3D modeling/design advice. I also provided a space for the Decentraland creator community to create videos/photos with a green screen near my club and has served many individuals so far. I have also created various content on my social media to help bring awareness to Decentraland.",
    "motivation": "I would like to contribute to the DAO to help support individuals and projects with unique ideas that will bring more creativity into Decentraland or projects that will improve the user experience. I also want to help ensure that DAO funds are being properly distributed to individuals within the grant proposals with a reputable track record, and individuals active in Decentraland. It is also important that these grant recipients stay active and continue to build before, during, and after their proposal is granted. Since I have designed multiple builds,I am able to have an understanding of the scope of work mentioned in these builder-related grants. I also want to help bring more diversity to Decentraland and ensure that a diverse mix of grant types are being properly passed (i.e. content creation, improvements to SDK, data analysis, etc). It is important that the right ideas are being brought into Decentraland, but also important to analyze whether enough funds have already been distributed to a “type” of idea already.",
    "vision": "My personal goal here in Decentraland as a 3D builder is to design as many builds/active scenes which bring value and retain users in Decentraland. I want to see more land parcels be developed so users don’t see empty parcels. An ideal Decentraland would be to see as minimal grass as possible. I want to help provide my services to dedicated creators/individuals currently active or coming into the space bringing value. I see the value of retaining our most creative users and want to help keep Decentraland growing through their work. In terms of Decentraland, I would love to see millions of active users engaging in the space, but also having a great user experience via unique events, games, and other experiences. This includes ensuring more users are able to access the space (i.e. mobile, desktop, VR), but making sure these experiences are flawless (minimal server issues, computer lag or audio issues, etc). So far, I love seeing how global Decentraland has become, connecting people from multiple countries in the world. I want to see more countries and more communities evolve in this space as a way to express their ideas, culture, and thoughts. For example, I am based in India and would love to see more of my community here.",
    "most_important_issue": "To me, marketing Decentraland is one of the most important factors and an issue currently. I want to see more advertisements of what Decentraland is, what events are here, what brands are coming in on various social platforms or mediums (i.e. Web2 Social Media, newspapers, TV ads, radio shows, web3 platforms, etc), as this is important to show users what is being done here. I feel like Decentraland has built an amazing portfolio of brands, builds, and unique experiences that have not been fully marketed to its potential. I also want to see more presence in future conferences surrounding emerging tech, Web3, metaverse, and VR. Ultimately, the goal is to get more users aware of the metaverse, but also be provided with the most resources to be educated about utilizing the platform. With Decentraland being backed by MANA, it is important to educate non-crypto users how the platform works with cryptocurrency. Additionally, educating those who may not fully understand the capabilities and importance of the metaverse in the current digital age. In the coming months, more metaverses are going to be created, which will increase competition for Decentraland. We, as a platform, will have to make our best efforts to keep users engaged and retained in Decentraland through many experiences/IT innovations/ smooth DCL functionality. Interoperability will also be a huge factor and how we communicate/network with other metaverses to bring more communities to Decentraland."
  },
  {
    "address": "0x05060Fa97e54a812d1E15cEc6c34e79f74eBD0b3",
    "bio": "I’ve been in Decentraland for about 2 years, I am largely involved in the development of Decentraland, and I sometimes will help new builders as much as possible in the discord channel. I also started Meta Live Studio back at the start of 2020. Most of our works were done in Decentraland, our most unique work is MetaGamiMall, a future metaverse mall in Decentraland.",
    "links": ["https://twitter.com/MetaGamiMall", "https://twitter.com/Metalivestudio", "https://metalivestudio.com/"],
    "relevant_skills": ["Metaverse Urban Design", "Architecture design", "Graphic Design", "3D modelling"],
    "involvement": "I spent nearly most of my time on Decentraland. I kept building things and holding events in Decentralnad. Feel free to check our work, especially MetaGamiMall, 146,60. Also, I kept providing help for the modelling-type developer and want to do more in the future as I believe there will be more need on this side, and there is not enough support for them.",
    "motivation": "I have a decent understanding of Decentraland as a project, and I got those experience from building and exploring thus I believe I can provide some useful opinions regards to DAO proposals, and I am willing to get more engaged with the community.",
    "vision": "Personally, I think Decentraland will be one of the biggest WEB3 metaverses in 5 years. And it has a great potential to be the biggest one. It will have exciting activities all the time, lots of traffic of course, and a place to celebrate the spirit of Decentralisation. And DAO is one of the biggest factors in how Decentraland can be Decentralised. DAO will be the future form of decision-making group, all for the future of Decentraland. Also, it’s a way for everyone who speaks their voice. Of course, you need to do something to make your voice loud, but at least everyone can speak about their idea equally. And this leads to a better form of community, collective decision making, and collective building.",
    "most_important_issue": "I see 3 evident issues for now. First, the threshold for development is too high as one of the biggest metaverse in web3. If we cannot let everyone can create things, then the project cannot expand on a great scale. The good news is DCL team is aware of this and wants to change this with the help of SDK7. Second, the total experience of DCL is not quite ideal, from the webpage design to the world laggy issue, we need to make DCL more professional, and luckily, DCL is aware of this issue as well and started to change it. Third, the DAO needs a better form of rules and ways to execute the rules. Now that we can see DAO is working, but we all know there are too many things to improve here, i,e the centralisation of votes and media rights in a small group of people’s hands, and sometimes, I would smell politics here. However, I think it will have a good future and really looking forward to it."
  },
  {
    "address": "0x89a1D730AA1e78A0EdE8DEa988AcECfF0A6e99a9",
    "bio": "My name is Szilard Janko (SzJanko), I am a professional underwater photo and videographer. Have been involved with blockchain tech since 2017, also minted my first NFT in 2017 and was part of DCL since the original land sales. Currently, I am building The Ocean Meta to onboard the ocean community into the metaverse.",
    "links": [
      "https://www.instagram.com/szjanko/",
      "https://www.szjanko.com/",
      "https://twitter.com/SzilardJanko",
      "https://www.theoceanmeta.com/"
    ],
    "relevant_skills": [
      "-Photography and videography (with featured work on Discovery Channels Shark Week, National Geographic, and many other publications)",
      "Photoshop",
      "Premiere",
      "Blender",
      "Social Media Management/Marketing/Growth"
    ],
    "involvement": "I have been involved with Decentraland since the initial land sale (the Terraform Event back in 2017). I invested in both land and the museum district. Originally I had a gallery built on my original land that I bought during the auction. Since then we have moved the gallery to my brothers land, where we are using it to build The Ocean Meta project. Our current goal with The Ocean Meta project is to onboard the ocean community to Decentraland, everything from the underwater world to surfing. We have a combined following between The Ocean Meta team of over 190,000 people that are interested in ocean related content. We plan to start onboarding these people once Instagram rolls out the full NFT features it has planned with Ethereum and Polygon integration. Until that time, we are focusing on building and contributing to Decentralands development. I have personally invested in multiple projects in Decentraland and with The Ocean Meta project, we have been showcasing ocean related art, have used it to host ocean themed gallery and educational learn 2 earn events, with many future events coming. Along with multiple collaborating events with Decentral Games, Snarky Sharkz, Dice Masters, B-Verse, Vroomway and other DCL projects.",
    "motivation": "I want to contribute more time to helping the development of Decentraland by participating in governance and proposal discussions. I want to see Decentraland stay in the lead of other metaverse projects, both because I am building my project, The Ocean Meta, here and because Decentraland offers a truly decentralized version of the metaverse vision. I think it is very important that we ensure that the decentralized metaverse is the one that will gain mainstream adoption. Having 5+ years of experience in investing and researching in the cryptocurrency/blockchain field, I think I have gained valuable knowledge that will help with Decentralands governance and proposal discussions/votes.",
    "vision": "My 5 year vision for Decentraland is to see it grow into the main metaverse platform that hosts a variety of content, from gaming, entertainment and educational builds. To see it become interoperable with multiple other metaverse platforms, both with decentralized and with private/centralized built platform. Allow users to move seamlessly with one account between all of these worlds. This also includes a web, client, and VR version of Decentralized that is capable of running high graphics, with low lag, and the ability to handles hundreds-of-thousands of users at a time.",
    "most_important_issue": "The most important issue for Decentraland is to create a feature rich base layer that makes it both easy and highly customizable for developers to build to the limits of their imagination. This base layer has to remain decentralized and open to multiple metaverses to eventually become interoperable with Decentraland. By creating a platform that opens up the limits of what is possible to be built here, it will attract the developers needed to create amazing gaming, entertainment and educational experiences here. The users / mainstream will come, once the platform is ready."
  },
  {
    "address": "0x1E93E534C5E26B01Ed242410b43AE23dD0fAA52b",
    "bio": "My name is Luke, I’m 29, and I live in the US, but I go by ile on discord and twitter. My expertise is in architectural and 3D spatial design. I lead the Varc (virtual architecture) District and am doing ongoing research into how organizing Land with channels allows users to get more use out of their Land.",
    "links": [
      "https://twitter.com/eellillee",
      "https://github.com/iillee",
      "https://sketchfab.com/varchitecture",
      "https://www.youtube.com/channel/UCU3IqLu5GeAPYHTuvfj5neQ",
      "https://drive.google.com/file/d/1Z5YSPgLxvI7NQZdxKppZvR6f8fxlLI--/view?usp=sharing"
    ],
    "relevant_skills": [
      "Traditional architectural education and training",
      "3D modeling (Rhino, Sketchup, Blender)",
      "Self taught SDK Developer"
    ],
    "involvement": "I’ve been involved with Decentraland since 2017 before the ICO and land auctions. I originally posted the idea for an architecture district on github and five other individuals agreed and contributed Land to the 19 parcel Varc District. Today I am the only fully active member of the district and use the land for experiments with the SDK and architectural form. I recently graduated with my masters in architecture where I did thesis research on the benefits of using channels to organize space in decentraland (see link above). Basically, channels allow landowners to take full advantage of their parcel’s square footage and polygon budget by reusing both infinitely. Also using channels to organize space informs a new style or architecture that is novel and unique and goes beyond copying IRL architectural tradition and form. I check DCL discords regularly, answer questions about building and workflow when I can, and try to experiment with the SDK and building new scenes daily. I’m fairly active in the DAO and generally support proposals having to do with content creation or improving the platform and governance system.",
    "motivation": "This application is in response to recent discussion on VP distribution and whale votes. I think our voting system needs to evolve beyond Mana = VP in the long term, but the best short term counter to whale power is an active and passionate coalition of voters with VP.",
    "vision": "This might be unfeasible or incompatible with how DCL is set up, but I see Decentraland evolving into a world of worlds. Where Genesis city becomes sort of a directory and each parcel of Land is a gate/link to privately hosted decentraland environments similar to how realms work today.",
    "most_important_issue": "I think one of the largest problems with Decentraland is its barrier of entry and accessibility. I worry that as other metaverse platforms mature, many new users will overlook Decentraland because it is too expensive and decide to use other more centralized platforms because they are free to build in. I’d like to see some sort of Freemium model for new users in Decentraland where every avatar is automatically given an out of world tutorial scene that they can experiment with and invite people to before buying Land in Genesis City. Another large issue with the platform is its lack of methods of interaction between avatars. Right now users can’t really do more than text or voice chat in world. I’d like to see functions like trading NFT’s, delegating VP, delegating Land operator rights, and voting in the DAO, all become actions avatars can easily do in world. This, I think, will move a lot of community activity off of 2D apps like the DAO page, discord, and the marketplace, and into Decentraland."
  },
  {
    "address": "0x9188872aBC65Cee15184fB9975de6a13730BdC74",
    "bio": "I write for magazines about Decentraland and digital fashion. I do a weekly newsletter around it, DCL Wearables Daily.",
    "links": ["https://linktr.ee/lenalisabona"],
    "relevant_skills": ["Writing", "editing", "basic graphic design", "community building", "marketing", "PR"],
    "involvement": "I joined Decentraland in February. Since then, I have started my weekly newsletter about the platform and its creators. In addition, I interview Decentraland people for such publications as Hackernoon, NFTPlazas, etc. I occasionally do Twitter space and interview creators live. I plan to contribute to more web2 and web3 magazines to write about the platform and its citizens.",
    "motivation": "I would love to be involved more in platform growth. I can bring my writing and publishing skills to help projects get their messages out there more simply and understandably. I also have my own online magazine (find it in my links), so I have experience creating content that can reach people without paid marketing. And have worked with top media outlets where I earned my media articles without paid promotions (Forbes, Guardian, TechRadar, you name it).",
    "vision": "I want to see Decentraland in more clear and simple light communication-wise. There are so many great things that people don’t know about at the moment because it’s hard to find or gather all information. I believe Decentraland will scale its content and messaging in more detailedly: every great event deserves the spotlight in the media. And I do believe that DAO must help creators who will carry that flag.",
    "most_important_issue": "Without the technical details, I think the biggest challenge is gathering information all over the place. As a writer, I gather information from all over the place: chats, Twitter, newsletters, Discord, etc. It’s messy and not reliable and often very complicated to read. The media don’t get the chance to be the first to know what will happen next in Decentraland. The media wants to be the first to write about it, and it’s usually too late for the story when the party is tomorrow."
  },
  {
    "address": "0x26871b48edad35f81901ab9002e656e594397e7d",
    "bio": "I am Potradamus I have resided in Decentraland since June, 2021. I spend an average, roughly around, 8-16 Hours per day and participate in a majority of the events and games within this space. I have promoted or sponsored events for Gallery187 and enjoy exploring Decentraland.",
    "links": ["https://twitter.com/potradamus"],
    "relevant_skills": [
      "Senior Systems Network Engineer A+,Net+,Net+Linux, MCP, MCSE, CCNA, CCNP",
      "Bachelors of Computer Science",
      "Assoc. of Network Engineering",
      "Life Long Video Gamer",
      "Crypto day trading"
    ],
    "involvement": "I am Holy Ones, Meta trekkers, TRU, Sugar club NFT holder. Games I participate in on a regular basis is WildernessP2E, Wonder Zone, Ice Poker, Dice Masters, Vroomway, and many of the parkours to name a few. I consider myself more of a community supporter then anything else and try my best to attend events and support as many artists and creators i can. I vote in the DAO regularly and try to participate as much as possible I believe this makes me a good candidate for VP.",
    "motivation": "I would like to have a bigger role in the shaping of DCL modeled in the Web3 space in the metaverse. This includes real decentralization, democratic voting, and a platform built by Web3 creators above the old models built around Web2. To help in the funding of promoting creators and builders for helping in the on-boarding of new daily users.",
    "vision": "I would like to see a fun and safe place for users, along with builders and creators, help to mold and evolve a metaverse where everyone is accepted, and opportunities for equality and monetization becomes a reality in the ever growing Web3 space.",
    "most_important_issue": "I personally think how the voting and who can participate, along with hidden votes should be a priority for the long term. In the short term I would just like to see a more robust and stable environment and the UI being a strong selling point to persuade and on-board new users."
  },
  {
    "address": "0x22ca65a6b15da45945e85949cf731d49ea52224b",
    "bio": "Psychologist by education, 23 years of experience in advertising agencies/ brand and communication strategies. Always close to NGO’s, social communication, believing communication can improve people’s lives.",
    "links": ["http://twitter.com/jacextudzinski"],
    "relevant_skills": [
      "Strategic thinking and visioning",
      "active listening",
      "community moderation and mediation",
      "public speaking"
    ],
    "involvement": "Online since Feb 22, a heavy user and follower, natural DCL evangelist, MANA maximalist, Forum member, DAO voter",
    "motivation": "I want to promote more involvement, discussion (drive engagement and understanding before rejection) and listening.",
    "vision": "The go-to place for free time with friends and discovery. With today’s entry price (LAND) - it will have to be sponsored is some way. DCL is the place for branded entertainment and creator economy.",
    "most_important_issue": "UX. Cross platform is harder than cross-chain - using DCL.exe is still a challenge an a huge area for improvement Adoption. Driving adoption is crucial. This will be driven by gameplay (making DCL more CPU-friendly), and marketing partnerships (it’s still the Web2 that drives Web3)"
  },
  {
    "address": "0x57d1721F6223EB434e20F5b4A88e494008eA0542",
    "bio": "Hello, My name is kevin and i go by Peterparker in the metaverse. I am interested in teaching people about this space and how to progress here and start building connections.",
    "links": ["https://www.twitch.tv/kevininspace_peterparker", "https://twitter.com/PeterParkerKev"],
    "relevant_skills": [
      "Great community member based on real values, I will support ideas and proposals based on the merit of the value the will produce and what they will bring to the entire DCL community"
    ],
    "involvement": "I am very active in the space, I stream content and have given over 1000 wearables away. I would say I have over 4000 plus hours in game and appreciate the wide range of style, creativity and hard work the community put into there spaces! The great things DCL does as far as events is not comparable to other web3 games! its a great experience to be able to put time and effort and actually earn and be a part of it all! Now I have the DCL name PeterparkerWeb3.",
    "motivation": "I feel like I am a great person who will stand for DCL as a true member that cares about the entire game progression, I only want great things for everyone in this space!",
    "vision": "I see DCL being on top of the web3 space and similar to a virtual facebook where people come to interact with friends and share experiences like playing games together, watching movies or music shows and meeting awesome people across the globe.",
    "most_important_issue": "Have a fair and balanced DAO that is based with active players that actually use the content provided so the game and space can grow."
  },
  {
    "address": "0x7bBea9C18CD0541ACab8c19DA2B11d0c03FAEf1C",
    "bio": "I enjoy metatrekking across the metaverse meeting new people and exploring new civilizations. I co-host an art showcase event on Twitter Spaces and in Decentraland. I enjoy hearing how artists create and the inspirations behind them. I am in the U.S. and old enough to know better, not set in my ways, and open to hearing different perspectives.",
    "links": ["https://twitter.com/existentialnoho"],
    "relevant_skills": [
      "I have been on a #DAO board for a small gaming token on the WAX blockchain which lead to much research on how they work. I vote on #governance proposals on multiple #blockchains. OSMOSIS, STARZ, EVMOS, WAX, EOS, MATIC, HIVE. I’ve challenged my self to learn creating #NFTs and have made a few small collections. I am looking to learn #Blender and possibly some #coding. Used #Canva to design my first #community-wearables"
    ],
    "involvement": "I have only been in Decentraland a short time. Officially since around May 2022. I co-host and art showcase event at -69, 139 and have had the pleasure to speak with many talented creators. I have hosted Twitter Spaces for the Beattrekkers DJ Battles that have been a huge success. I have met many people from different places on the planet. One main way is the Universal Greetings Project in the Community Building Decentraland discord. This started as a personal project but led to something bigger. I would take photos of my avatar and numerous different people throughout DCL and they would translate “Welcome to Decentraland” to a foreign language. Spanish, Portuguese, Italian, Greek, Arabic, Farsi, German, Norwegian, Finnish, Malay, Chinese, Japanese and more. I am also currently a part of a Rock Paper Scissors tournament event that will happen soon and next year be involved with an educational project and a Beattrekkers II.",
    "motivation": "To help make sure that all VP is being used to vote for important proposals whether they be a YES or NO. It will also give me a reason to talk with other community members about the various proposals put forth and learn more about the wants and needs of Decentraland.",
    "vision": "I hope there can be less conflict amongst the community. There is far too much and is not productive. I incorporated the Nteasee symbol in my first wearable design for a reason. The symbol comes from Ghana and represents a community coming together to resolve conflict. There is too much focus on the things that ultimately don’t matter and things that need to be fixed should be brought into the spotlight. There will come a time that there will no longer be a foundation and how we can continue to grow and succeed as a community together is what is needed.",
    "most_important_issue": "Interoperability has been another subject I hear much of, but little more than talked about. I would like to see efforts made towards this goal, if there are none already. There is a Metaverse Standards Forum that I would like to see DCL DAO work with to ensure we are not isolated. In the next 12 -24 months we could face more turmoil in the crypto community. Safeguarding the peoples assets should be a focus. Promoting Wallet safety. Scams on Open Sea continue to be an issue. Cyberbullying should be addressed. Who does one go to if they are bullied. 3rd parties will need to be brought in to handle many tasks. Marketing, Devs, etc. A.I and V.R will open up new methods that we have not even thought of yet. Lots to do. Let’s build a better world, together."
  },
  {
    "address": "0xd4f1cAb694c4424C4796549edbb9B489789F4Df5",
    "bio": "My name is Tudamoon, been in DCL since March 2021. I have always been into freedom. Freedom is actually what got me into crypto in 2016. Love learning new things. Currently, I own and operate a skill games business in the US. I am in the start-up process of building an NFT rating platform for lenders. When it comes to policy, I am a firm believer of embracing as much as we can while keeping a fair system.",
    "links": ["https://twitter.com/Tuda_moon"],
    "relevant_skills": [
      "My past experiences are what made me who I am today. I am going to share my experiences here because I believe in transparency and care about this space. I fear if we only give positive experiences, people will be too afraid to fail or be themselves, kind of what we see in the real world today. I have always been about freedom and rights. It took me down many rabbit holes. Became a paralegal through school, interned for the ACLU. Worked in civil litigation for a little while and considered becoming an attorney. I got discouraged when I found out you have more power by NOT being a licensed attorney. Then I moved into politics. Ran for local office and then ran for state office as a libertarian. Soon after, I got arrested for being argumentative with a police officer (was wrongly charged with a felony Assault on a Law enforcer). Did 6 days in jail to have my charge dropped because you can’t fight city hall. Nothing like being butt-naked and cupping your balls and coughing during a strip search. Oh yeah and jail food is for the birds. Jail was an interesting experience. Two things I learned from this are: to lose my ego (nature and the market don’t care) and that it is extremely hard to change a system. The best way to fix a broken system is to outcompete it with a better more improved system. In 2016, that’s what got me into crypto. My early crypto funds ended up getting seized on BTC-e, but I sure do miss reading the Troll Box. Learned the hard way: not your keys, not your crypto. Wrote a book on investing in crypto in 2018. Then in 2020, I got into the Skill Games industry in the US starting with $3k total and turned into a multi-million-dollar business in less than a year. Had 18 employees, grew too fast and I am still learning that lesson. Currently, while I am running that business, I am in the process of building an NFT rating platform for lenders. I feel these experiences are just as good as relevant skills because it makes me a more well-rounded voter in the DAO."
    ],
    "involvement": "I have been using Decentraland since March 2021. I am mostly an end-user. I have created a few wearables and own a few land parcels. I am also really involved with the Holy Ones family.",
    "motivation": "Originally, I didn’t want to be a delegate. However after seeing some people throwing their VP around like candy, I want to be the force that promotes principles and ethics. I think it is needed in this space. I have seen greed take over people’s morals. I don’t believe people are bad, but I do think greed and fear get the best of us all at some point in time. My goal is to try to be level-headed in my decision-making and do what is best for the long-term for Decentraland.",
    "vision": "In 5 years, I want to see Decentraland filled with many things to do. I want a full moving economy. I think Decentraland should be a fairer system that embraces as many freedoms as possible.",
    "most_important_issue": "Infrastructural upgrades, End-User Experience, and changes in DAO Governance. We need to keep pushing forward."
  },
  {
    "address": "0x3e84Ce23Da2ed913B7fc877a9DA31F6Afc138D5a",
    "bio": "Hello, My name is Yasha, I’m the founder of a smart wearables startup called Gaian, and a digital studio called Trix. I’m also head of metaverse at Limewire.",
    "links": [
      "https://www.twitter.com/storyofyasha",
      "https://www.instagram.com/storyofyasha",
      "https://www.gaian.co/",
      "https://www.trix.studio/"
    ],
    "relevant_skills": [
      "Producing large-scale metaverse events",
      "designing wearables",
      "motion capture performances",
      "brand partnerships",
      "Grammy nominated director",
      "patented inventor"
    ],
    "involvement": "I’ve worked with Decentraland on multiple occasions. First to unveil their movie theatre to screen a video I directed for Jim Jones and Migos “We Set The Trends” video, then to create a Limewire venue and Soulja Boy headlining performance for #MVMF22",
    "motivation": "I love DCL and want to help it succeed.",
    "vision": "I see DCL as the go-to for metaverse events, meetups. I see DCL as having fully integrated VR compatibility and being fully available on all Oculus devices and others. I would love to see more mainstream adoption. the DAO can help make that happen by funding the right projects.",
    "most_important_issue": "VR integration. Low active users, but this is an opportunity to build the infrastructure that will be needed during the next influx in daily users."
  },
  {
    "address": "0x71a604439106269734935f82460efcC58cCA84bb",
    "bio": "I am Unai Da Silva from Spain, I am process engineer and project manager of Imagine to Create, a web3 project focus on creating a community of professionals, entrepreneurs and investors. I am the web3 environment since end of 2019 when I start studying about Bitcoin and Ethereum.",
    "links": ["https://twitter.com/unai2Create", "https://www.imaginetocreate.com/"],
    "relevant_skills": ["web3", "Project management", "analyst", "copywriting", "community building"],
    "involvement": "I am in Decentraland since May 2020 when I entered for the first time, I bought my name “Unai.dcl.eth” in september 2020 and I started to build, we started to develop Imagine to Create in Decentraland throught our Gallery, Galería Imagine that is in Vegas District (.124,85 and -121,91). I have helped hundreds of people to access decentraland through divulgation on twitter where I always have shown my dcl avatar in the profile and references to Decentraland in my name and I am admin of the telegram group in Spanish about decentraland with more users (760 at the time of writing this text). Together with other communities we have organized the first music festivals 100% in Spanish (Festiverse and CalaVerse), making decentraland known to high-calibre artists in the Latin world. Through Imagine to Create we have contributed to making this platform known among a multitude of companies in Spain since Imagine to Create has always had great activity through the art gallery and the objective is to continue growing in decentraland and helping the Hispanic community to break the language barrier and expand across decentraland.",
    "motivation": "I want to obtain voting power since I want to help promote projects that have the real capacity to take the platform to a new level in addition to bring new users to decentraland and new developments that improve the features of the platform making it the number one social network on the web 3. For example, I would like to support creators with disruptive ideas who want to develop their talent in decentraland through new applications or integrations with new technologies or new chains.",
    "vision": "I think Decentraland is much more than a virtual world for me it is the most advanced web3 community within the main community that is Ethereum. In it all kinds of entrepreneurs, creators, investors and players coexist and share their ideas, their visions and their projects. The philosophy about blockchain and decentralization that exists in decentraland is what attracts me the most and I believe the role of the DAO is to take care of that feeling and make it continue to flourish since the community that exists wants to voluntarily develop their professional careers around this platform. The grants program, the editor-SDK and the governance system are unique in my opinion in the ecosystem and could work as standards in the future for similar platforms. In the coming years I would like to see how new creators and new investors see Decentraland as the ideal metaverse prototype to create a community where power and wealth are decentralized. I would like to see the best talents and the hardest workers rewarded for their merits and recognized in the community revealing themselves as the future leaders of the web3",
    "most_important_issue": "I think that getting the new SDK7 to succeed and be used by the community is a great challenge, making it easier for new creators with little experience to build in decentraland without knowing how to code is a great idea and making it work and creativity flow could bring new ideas to the platform, new business models and new projects with new communities that could contribute to the economy of the platform. That is why I also believe that dclworlds has been a great idea, giving everyone more access to building experiences. I don’t think there is a user traffic problem, the problem for me is the hardware needs that users need to be able to navigate the world. Publishing a mobile app, even if it wasn’t the same experience as on the computer, would be key to reaching many more users and promoting new business models in decentraland. As I said before, I don’t think the important thing is to bring people to the virtual world, the important thing is to show the great community that exists, full of knowledge about decentralization and with a philosophy of collaboration and innovation that is unique not only in the blockchain community but also generally in the digital world."
  },
  {
    "address": "0x5b5cc427c1D81Db4F94DE4d51D85ce122D63E244",
    "bio": "I consider myself as a professional with extensive experience in leading and coordinating teams, planning and project management. I have a very marked social sciences background, but I also have been involved in techonology and IT projects the last couple of years.",
    "links": ["https://twitter.com/federiconh", "https://www.linkedin.com/in/federico-holzwarth-3557a866/"],
    "relevant_skills": [
      "Throughout my professional career, I have been able to interact and establish lasting and successful bonds with stakeholders from the private sector, civil society organizations, political groups, and public administration at all levels, to develop and implement projects and meet the needs of the organizations which I belonged to, managing to set expectations between all parts involved in a successful way. Since 2010, I have worked in +5 different areas from local governments and at the same time, actively collaborated with NGOs. During those years, I was involved in high scale projects and led different cross-functional teams in order to deliver the Buenos Aires 2018 Youth Olympic Games and most recently, led a task force for the Buenos Aires City Emergency Committee during the pandemic. I’m currently working as a Sr. Program Manager in a media/data analytics company, leading cross-functional teams from different countries and dealing with conflict resolution and intercultural communication every day to deliver results for different clients right on schedule."
    ],
    "involvement": "I’ve been following this project from the outside since 2018, because I personally know some collaborators and land owners. A couple of months ago, I got more involved by collaborating with the SDK team to document specific architectural decisions and to bring more transparency through some posts in different platforms (‘SDK - Under the hood’), in order to disseminate technical information in an understandable way for everyone and get direct feedback from the community. Since December 22’, I’ve been fullfiling the role of Governance Facilitator within the DAO Facilitation Squad.",
    "motivation": "Addressing VP distribution. Transparency mechanisms between DAO-Foundation. Decission making process structure",
    "vision": "My 5-year vision is that Decentraland will consolidate as the main decentralized metaverse and also would expect a greater interoperability between DCL and other blockchain based platforms, such as other metaverses. I strongly believe that there will be an exponential and increased adoption of Decentraland from users with less technical knowledge about web3, and that developed and adopted technologies will continue to be a breakthough at a worldwide scale.",
    "most_important_issue": "VP distribution and the lack of incentives to participate and engage in votings and the decission making process."
  },
  {
    "address": "0x8218a2445679e38F358e42F88fe2125C98440D59",
    "bio": "Hi all, I go by 1010(TenTen). I have been in Decentraland since late 2021. My involvement in DCL encompasses not just being an active user, but also building scenes for deployment(recreationally). I am also a multiple LAND/ESTATE owner currently running scenes on ALL of my estate, leaving none barren and only for investment.",
    "links": ["https://twitter.com/thehiddenwalls"],
    "relevant_skills": [
      "8 years experience as a traditional retail investor",
      "Owner of 18 plots of LAND (as of today)"
    ],
    "involvement": "",
    "motivation": "My mandate as a delegate is to represent the interests of LAND/ESTATE owners. Too often than not, LAND owners’ representation has been under the radar/ignored. It has been more obvious with the drastic implementation of Worlds, without the consultation of its users/investors. I want to change that. My goal is simple, to vote in matters that affect LAND, both directly and indirectly, and to be the voice of reason. I intend to keep an open channel to all LAND owners via twtr/discord, so that I may represent them.",
    "vision": "Web2 has segregated us, and with that compartmentalization, placed us in echo chambers that only reinforce our own thinking. This has led us to our current state of affairs, a world divided with little sense of tolerance and not much exposure to other people’s worlds. In 5 years, I hope that Decentraland has achieved its goal of being optimal in user-friendliness. I also wish to see a bustling Genesis City, with users seamlessly participating in not just 1 but concurrent events that go on side by side, as is IRL. That way we are exposed to everyone’s interests, not just our own.",
    "most_important_issue": "The representation of different interests, from the creators, to the whales, to the LAND/WORLD/NAMES owners, all the way to the users. In a decentralized world, all who participate actively and contribute deserve a vote."
  },
  {
    "address": "0x4ec0bCF5E3bD218381acf3C889919Bc4Ef12fEBd",
    "bio": "Entrepreneur and blockchain enthusiast passionate about exploring the potential of Decentraland. I’m a creative thinker who enjoys building communities and developing new ideas to make the metaverse more accessible and engaging for all.",
    "links": [],
    "relevant_skills": [
      "Community building",
      "entrepreneurship",
      "marketing",
      "blockchain",
      "strategy",
      "project management"
    ],
    "involvement": "I’ve been involved with Decentraland for over a year now and have been active in the community as a builder, investor, and advocate. I’ve contributed to the development of several Decentraland projects and have been working closely with other community members to help grow the ecosystem.",
    "motivation": "I want to be a delegate because I believe in the potential of Decentraland and want to help shape its future. I believe that the DAO can be a powerful force for change in the ecosystem and want to be part of that change. As a delegate, I will work tirelessly to promote transparency, accountability, and community engagement within the DAO.",
    "vision": "In the next 5 years, I envision Decentraland as a thriving metaverse with a diverse and engaged community. I see a world where anyone can create, explore, and monetize their own unique experiences in Decentraland, and where the DAO plays a critical role in shaping the ecosystem and ensuring its long-term success.",
    "most_important_issue": "The most important issue in Decentraland right now is scalability. As more people join the platform and more content is created, the network will need to scale to meet the demand. This will require a concerted effort from the community and the DAO to find sustainable and scalable solutions. Additionally, I believe that community engagement and transparency are critical issues that the DAO must address in order to foster trust and build a strong, inclusive community."
  },
  {
    "address": "0xed0E0cb94F60F72ec94beF848f5dF4Cbd365aF1D",
    "bio": "Greetings! I am a passionate 3D artist and content creator with a unique background, I was raised by Decentraland itself! I have honed my skills in creating and coding scenes for the Metaverse, and now I’m seeking your support. As a delegate, I will use my expertise to create exceptional experiences and contribute to the growth of DCL’s vibrant community. With a proven track record as a Twitch streamer. I am confident that I can help shape the future of the Metaverse. Join me on this exciting journey and let’s make DCL the best it can be!",
    "links": ["https://linktr.ee/injesterr"],
    "relevant_skills": ["Project manager", "3D Artist", "Moderator", "Content Creator", "Supporter"],
    "involvement": "As a Twitch streamer and content creator, I’ve had the opportunity to engage with the Decentraland community in a unique way. From showcasing my 3D art skills to creating immersive experiences for my viewers, I’ve always been passionate about sharing my love for DCL with others. During my time on Twitch, I had one of the fastest-growing channels in 2021, and although I may not have been the biggest, I had an incredible following that made the experience truly special. I onboarded and supported many known Decentraland creators, I used my platform to connect the right people with each other and gave my 100% to boost engagement for small projects. I did nearly 20.000+ giveaways manually back in the day and got many people their first 1.000 followers on Twitter, their first 400 members on Discord and help boosting their DCL sales.",
    "motivation": "Recently since end 2022 I also became familiar with the DCL DAO and have contributed my opinions ever since, at one point early in my DAO days I even got a grant for $10,000 but unfortunately I screwed up, Talking from experience I think its important to learn from mistakes and use it as experience for the future, I want to become a delegate to make sure your voting power is used in the right way.",
    "vision": "I am creating and working on a Project called Duel Arena, and in these upcoming 5 years I want to have this big project to represent Decentraland in the best way possible. I think that many more projects in DCL strive to represent Decentraland in this way so I believe that if we support the right projects with grants, and give the right parcels POI, make the right DAO decisions, only then Decentraland will become the biggest MetaVerse in 5 years from now.",
    "most_important_issue": "The biggest issue in Decentraland is people not understanding the concept of a Decentralized MetaVerse, people coming into this space think that they can't build and everything is done by some developers and 3D artists, but in the meanwhile, they don't realize how much there simplest idea can change the entire space."
  },
  {
    "address": "0xe1951cEca2Cca5F7EbEB23b1DfDb8eB383f2EB1F",
    "bio": "I am a crypto research analyst, working in a crypto investment fund with $10M AUM. Of course I have no access to that fund hahaha.",
    "links": ["https://twitter.com/AkasyaEth", "https://akasya.xyz/", "https://app.ens.domains/akasya.eth"],
    "relevant_skills": [
      "Web 3",
      "Research",
      "Technical Analysis",
      "Fundamental Analysis",
      "Equity",
      "Crypto",
      "Forex",
      "Regulatory Landscape",
      "Macroeconomics",
      "Economics",
      "Husband and a Father of 1"
    ],
    "involvement": "I own Decentraland estate 77,-101 and 77, -102. Lend it to the market but still own the 4k VP.",
    "motivation": "As investor, I want DCL to grow in terms of revenue stuff. Of course, this will be effective if we can spend the DAO budget properly and not for accelerating projects that has little to no impact to DCL. As an estate/landowner, I want the user experience to improve without sacrificing the core principle of the project. Although we can see the project improve with DCL editor and other stuff, having enough VP (from Delegation) can help builders to have a proper and honest vote. Using my expertise, I believe honest opinions can be raised, which will lead the DCL project towards its intended goal.",
    "vision": "My 5-year vision for Decentraland is it can host millions of users with a very low barrier of entry. This can be achieved if the DAO can decide a proper pathway, and NOT for temporary traffic.",
    "most_important_issue": "I believe the most important issue for DCL is the barrier of entry. The pain points in my perspective are: Users need to have a superb computer so that they can access our metaverse. Land utilization is low. Low adoption rate. User experience is good but needs to be competitive enough as more metaverse projects emerged. Decentraland (MANA) as security (US SEC). Decentralization health is questionable as the DAO and the Decentraland Foundation power is imbalanced."
  },
  {
    "address": "0x8B257B97C0e07E527B073b6513ba8Ea659279b61",
    "bio": "Its’a me, Morphbot - Focused on bringing interoperability and VR development ideas to the space. I believe whole-heartedly that DCL is about decentralization, and enabling the creator community via open source initiatives.",
    "links": ["https://twitter.com/morph_bot", "https://www.twitch.tv/morphbottv", "https://kick.com/morph-bot"],
    "relevant_skills": [
      "Full-stack engineer",
      "post-graduate degree in Computer Science",
      "Technical architecture consultation at double-digit Fortune companies",
      "Crypto since '17",
      "VTuber & interoperablity researcher"
    ],
    "involvement": "I properly dove in around 2021, when NFTs were heating up and I was looking into 3D asset ownership, I saw a need for 3D platforms/frameworks, and went out to create a 3D VTuber from assets purchased off the Ethereum marketplace. This journey brought me quite literally ‘across the metaverse’ and full circle to conclude DCL as the greatest customizable and open avatar platform that exists today, a spark that I’ve tried my best to push on to others, advocating for .VRM and interoperability for the ‘general metaverse’ ever since my first successful DCL avatar export w/ full face tracking and mouth/eye movement (~Feb/March 2022) Moving on from this technology, I seeked out .VRM compatible experiences, which drove me to my first VR hardware purchase since the Oculus DK1 - As the metaverse was a concept I’ve always loved, but never felt was really within reach - until now. It was only when I was finally able to put these ideas together, alongside with the original Decentraland vision built on top of JanusVR to one day be an interoperable, web-driven, VR world - that I truly began to understand what Decentraland would be.",
    "motivation": "There is too much toxic-positivity in the DAO hoping for grants to work out, many people without proof of concepts, or solid real world experience attempt to garner support for ideas that often can be invalidated before they even begin. I don’t believe the DAO exists to fund startups that are too risky, or too low quality to receive VC investment, and until opportunities that are of a certain quality arrive, we should protect the funds to our best diligence. Every DAO-printed mana that is sold is a tax to all DCL citizens, investors & users, many of whom have worked tirelessly to provide and contribute to the open source environment and DCL platform - we have a duty to protect the treasury from those that wish to pilfer it for their own income, with no viable plan or intention to help return value that outperforms the investment given.",
    "vision": "I see Decentraland as the backend of the metaverse, all of our clients (desktop/browser/VR) are merely interpretations of the DCL data and ecosystem for our users to connect. Through native technology and platform improvements, we live in a time where the original vision of DCL, being a browser-driven, VR, interoperable metaverse platform is possible - with the right planning and hiring of competent devs who have already built provable concepts implementing these ideas, we can push forward the native metaverse: DCL characters in every game that wishes to implement them, kicking off a wave of personalized VR avatars that causes a flourishing of market activity both for the DAO and the platforms creators, enabling shapekey & jiggle bones improvements to bring the market place to a competitive level. Users interoperably jumping between worlds of various platforms in their VR headset alongside friends, increasing the value of DCL overworld & platform, acting as a place to centralize logic for seamless exploration between even different metaverses! Don’t you wish you could wave your arms around, or talk/hangout with your friends while the actual avatar mouth moves from voice chat, with your eyes/head movement based on where you’re looking and facial micro expressions that make it feel like you are actually IN Decentraland and physically spending time with people?",
    "most_important_issue": "I believe the DAO simply lacks direction on what the optimal use of funds could be, or what to do with funds during a bearmarket while we lack that direction, we need to have larger conversations about how the DAO can enforce a certain level of impact to ensure grants benefit all DCL users at large. Given that VR has been removed from the foundation roadmap, it becomes clear that we as a DAO must figure out a legitimate path towards VR implementations within our platform, not just at the interface level, but by supporting native VR interfaces at the platform level that any developers can connect to (such as WebXR). This concept would not only add great value to our platform, it would unlock a massive number of business use cases and improvements for all metaverse native businesses. What challenges will we face in the next 12 to 24 months? The bear market has been rough, after a 90% slide-down in mana it is clear there is a growing concern of what the future holds. I want to be clear, this is normal procedure in crypto, and while we may want to prepare ourselves for future cycles, we must be very careful about acting rash in a time of such negative average price disparity. What we can do, is rally together, cut spending, and unify on ideas that will multiply the value of the DCL platform for all involved - That’s why I’m here, even though I hate politics and would much rather be working on my avatar ecosystem."
  },
  {
    "address": "0x3429CbFf7EB34e4C9dD9D7E41041fd7b2a01FdB0",
    "bio": "Decentraland Verified Partner and founder of the DCL Brasil community.",
    "links": [
      "https://x.com/atrovenado",
      "https://www.instagram.com/decentraland.brasil",
      "https://linktr.ee/decentralandbrasil"
    ],
    "relevant_skills": ["Project management"],
    "involvement": "I’ve been a Decentraland citizen since 2021. Since then I released several wearables, founded the DCL Brasil community, thrown lots of events and connected/onboarded lots of users",
    "motivation": "The community has voiced their wish to delegate me recently, so I’m just formalizing the request",
    "vision": "Stronger and active communities",
    "most_important_issue": "I believe our biggest priority is to improve software performance. Also onboarding and engaging new and old users"
  },
  {
    "address": "0xD1759165409B64fb4e58CEa071424Fd28fC963cf",
    "bio": "I’m experienced marketing specialist, content creator, 3D/VR educator and currently serves in the Strategic Relations role for the Decentraland DAO Facilitation Squad. I have over 15 years of experience teaching Digital arts in visual art centers and have worked as an educator with various STEM programs for over 10 years",
    "links": ["https://twitter.com/Fractilians7"],
    "relevant_skills": [
      "Marketing",
      "Content Creator",
      "Premiere Pro",
      "Illustrator",
      "Photoshop",
      "Web Developer",
      "3D modeler",
      "Unity",
      "Cross metaverse Builder",
      "Wearable Creator",
      "Community Engagement"
    ],
    "involvement": "In early 2021, I joined Decentraland and fell in love with the creative possibilities and community. As an art curator, event coordinator, and member of the DCL Reporter crew, I interviewed creators and builders and did tutorials for a year. I also participated in a tier 6 grant with IRL Art as a builder, wearable creator, and event coordinator. For the past year, I’ve been a member of the Decentraland DAO facilitation squad with a Strategic Comms focus. Additionally, I’m honored to be one of the artists invited to the upcoming Beta Launch of the MESH art show. As a builder and creator at heart, I’m dedicated to serving and supporting the community",
    "motivation": "I love creativity, learning, collaboration and building. Those are all the things that originally led me down the rabbit hole to Decentraland and those are the reasons driving me wanting to be a delegate. Since the first day I entered Decentraland I have been fascinated and inspired by the community of builders working diligently to make the amazing experiences and builds in Decentraland. I have built and been a part of various grants, learned from many different creators, interviewed and hosted countless events and for the past year I have been serving the community as a member of the Facilitation Squad. I want to help be a positive voice for the builders and creators and feel that all that I have contributed to DCL so far has really given me a good understanding of the heart of this community. I would love the opportunity to help that amazing heart grow",
    "vision": "I see it as the central hub of collaboration and creativity across all Metaverses. It will continue to grow and become known as the playground for innovative experiences. Educators, students, brands, entrepreneurs , universities, business incubators creators will cross-polinnate and build together. Since I started as a DAO facilitator, I’ve been serving the community and attempting to share the light and innovation in this community. I want to continue to build pathways for that story to be told to the community and to all others. I want to see more collaboration and less destructive behavior. I hope to promote that and hope that this simple idea of sharing the positive, will help light a pathway to that positive collaboration",
    "most_important_issue": "One of the most important/challenging issues is with VP distribution and the lack of incentives to participate and engage in votings and the decision-making process. I don’t really see challenges as challenges but as opportunities. I don’t see we have competitors I think we have amazing opportunities for collaborations. I think growth and onboarding which are seen as challenges will be where we see the most innovation and creativity"
  },
  {
    "address": "0x1B35f4D22B2C8Bc706bCFCc383A1CA77FB4fC600",
    "bio": "Retail manufacturer, with points of sale in Spain for more than 15 years and online sales in other countries. I’ve been in Web2 business since 2010, crypto investor since 2015. DCL verified creator and have developed several wearables and VRMs for other virtual worlds.",
    "links": ["https://punkpink.eth.limo/", "https://twitter.com/PunkPink__", "https://discord.gg/9HeZN3g75f"],
    "relevant_skills": [
      "3d Modeling",
      "Web Development",
      "Branding",
      "Graphic Design",
      "Business",
      "Manufacturer",
      "Web3"
    ],
    "involvement": "I joined DCL in November 2022, attracted by the customization that the platform allows and its great potential, I saw that this was a great moment to establish myself as a creator and begin to build a long-term commitment to this community, almost a year later I am still enjoying this platform, I have made good friends and I think the most exciting thing is yet to come. Over the last few months I have felt great interest in the governance processes of Decentraland, coming to realize the enormous importance of the involvement of us (the users) in the voting. As a relatively new user in Decentraland I can see very closely the reasons why I entered and why I would not have done so, I think that having entered Decentraland in a bear market gives me a fairly objective view of the reasons why many users are not logging into the platform right now, and I would love to change this.",
    "motivation": "For almost a year I have been trying to find my place in the community, I believe that being a delegate would be a great step forward for my involvement in the community and in Decentraland’s governance processes. Another reason why I think I should run as a delegate is because I have full availability to dedicate myself to DAO affairs and I really want to start seriously with this. I am also concerned that Decentraland is having serious problems attracting new users and I firmly believe that this problem is the first one we need to solve. At the same time, I do not think that being in a bear market serves as a justification, I think that if we enhance certain aspects of the platform we will significantly increase the number of users.",
    "vision": "I would like to see how we work together to turn Decentraland into a fully populated place, not just for a few hours and in a few scenes, but in any area* throughout the day *, I don’t think it will be something difficult to achieve, the way just hasn’t been found yet. I believe that the DAO is a very powerful instrument that is being used as a game, good governance can make Decentralnd become an attractive place for new users, but misused it can cause the platform to collapse.",
    "most_important_issue": "The most important thing, (and this is something I’m completely convinced of) is to attract new users to the platform as soon as possible. The DAO funds are not infinite and are being used for matters I don’t consider a priority. I believe there are many projects that hold significant value but could wait. I also see few proposals aimed at paving the way for new users and creators. I am convinced that if the platform is user-friendly and appealing to everyone, people will start joining, regardless of whether it’s a bear or bull market. I also understand other secondary issues that are indirectly affecting the entry of new users, and of course, there are many areas for improvement that do not have a direct relation to attracting more people to Decentraland. However, I believe they should take a back seat until we solve the main problem."
  }
]
